Tejaswini-KR/3-Phase-Smart-Meter/Source/rl78i1c/application/modbus/iodefine.h
/******************************************************************************/
/* DISCLAIMER                                                                 */
/* This software is supplied by Renesas Electronics Corporation and is only   */
/* intended for use with Renesas products. No other uses are authorized.This  */
/* software is owned by Renesas Electronics Corporation and is protected      */
/* under all applicable laws, including copyright laws.                       */
/* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES          */
/* REGARDING THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING  */
/* BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR */
/* PURPOSE AND NON-INFRINGEMENT.  ALL SUCH WARRANTIES ARE EXPRESSLY           */
/* DISCLAIMED.                                                                */
/* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS     */
/* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE       */
/* LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL      */
/* DAMAGES FOR ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS    */
/* AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.           */
/* Renesas reserves the right, without notice, to make changes to this        */
/* software and to discontinue the availability of this software.             */
/* By using this software, you agree to the additional terms and conditions   */
/* found by accessing the following link:                                     */
/* www.renesas.com/disclaimer                                                 */
/*                                                                            */
/* Device     : RL78/R5F10NPL                                                 */
/* File Name  : iodefine.h                                                    */
/* Abstract   : Definition of Special Function Register (SFR)                 */
/* History    : V1.00  [Device File version]                                  */
/* Options    : -df=C:\Program Files (x86)\Renesas Electronics\CS+\CC\Device\ */
/*              RL78\Devicefile\DR5F10NPL.DVF -o=E:\SM_3phase\Test Codes\Sm_3 */
/*              p_UART1_MODBUS_TestCode\iodefine.h -f                         */
/* Date       : 05-06-2024                                                    */
/* Version    : V1.18.00.03  [df2iodef.exe version]                           */
/* This is a typical example.                                                 */
/*                                                                            */
/******************************************************************************/
#ifndef __R5F10NPLIODEFINE_HEADER__
#define __R5F10NPLIODEFINE_HEADER__

typedef struct
{
    unsigned char no0:1;
    unsigned char no1:1;
    unsigned char no2:1;
    unsigned char no3:1;
    unsigned char no4:1;
    unsigned char no5:1;
    unsigned char no6:1;
    unsigned char no7:1;
} __bitf_T;

typedef struct
{
    unsigned char no0:1;
    unsigned char no1:1;
    unsigned char no2:1;
    unsigned char no3:1;
    unsigned char no4:1;
    unsigned char no5:1;
    unsigned char no6:1;
    unsigned char no7:1;
    unsigned char no8:1;
    unsigned char no9:1;
    unsigned char no10:1;
    unsigned char no11:1;
    unsigned char no12:1;
    unsigned char no13:1;
    unsigned char no14:1;
    unsigned char no15:1;
} __bitf_T2;



#define PU0            (*(volatile __near unsigned char  *)0x30)
#define PU0_bit        (*(volatile __near __bitf_T *)0x30)
#define PU1            (*(volatile __near unsigned char  *)0x31)
#define PU1_bit        (*(volatile __near __bitf_T *)0x31)
#define PU3            (*(volatile __near unsigned char  *)0x33)
#define PU3_bit        (*(volatile __near __bitf_T *)0x33)
#define PU4            (*(volatile __near unsigned char  *)0x34)
#define PU4_bit        (*(volatile __near __bitf_T *)0x34)
#define PU5            (*(volatile __near unsigned char  *)0x35)
#define PU5_bit        (*(volatile __near __bitf_T *)0x35)
#define PU7            (*(volatile __near unsigned char  *)0x37)
#define PU7_bit        (*(volatile __near __bitf_T *)0x37)
#define PU8            (*(volatile __near unsigned char  *)0x38)
#define PU8_bit        (*(volatile __near __bitf_T *)0x38)
#define PU9            (*(volatile __near unsigned char  *)0x39)
#define PU9_bit        (*(volatile __near __bitf_T *)0x39)
#define PU12           (*(volatile __near unsigned char  *)0x3C)
#define PU12_bit       (*(volatile __near __bitf_T *)0x3C)
#define PIM0           (*(volatile __near unsigned char  *)0x40)
#define PIM0_bit       (*(volatile __near __bitf_T *)0x40)
#define PIM1           (*(volatile __near unsigned char  *)0x41)
#define PIM1_bit       (*(volatile __near __bitf_T *)0x41)
#define PIM4           (*(volatile __near unsigned char  *)0x44)
#define PIM4_bit       (*(volatile __near __bitf_T *)0x44)
#define PIM5           (*(volatile __near unsigned char  *)0x45)
#define PIM5_bit       (*(volatile __near __bitf_T *)0x45)
#define PIM8           (*(volatile __near unsigned char  *)0x48)
#define PIM8_bit       (*(volatile __near __bitf_T *)0x48)
#define POM0           (*(volatile __near unsigned char  *)0x50)
#define POM0_bit       (*(volatile __near __bitf_T *)0x50)
#define POM1           (*(volatile __near unsigned char  *)0x51)
#define POM1_bit       (*(volatile __near __bitf_T *)0x51)
#define POM5           (*(volatile __near unsigned char  *)0x55)
#define POM5_bit       (*(volatile __near __bitf_T *)0x55)
#define POM8           (*(volatile __near unsigned char  *)0x58)
#define POM8_bit       (*(volatile __near __bitf_T *)0x58)
#define PMC2           (*(volatile __near unsigned char  *)0x62)
#define PMC2_bit       (*(volatile __near __bitf_T *)0x62)
#define NFEN0          (*(volatile __near unsigned char  *)0x70)
#define NFEN0_bit      (*(volatile __near __bitf_T *)0x70)
#define NFEN1          (*(volatile __near unsigned char  *)0x71)
#define NFEN1_bit      (*(volatile __near __bitf_T *)0x71)
#define ISC            (*(volatile __near unsigned char  *)0x73)
#define ISC_bit        (*(volatile __near __bitf_T *)0x73)
#define TIS0           (*(volatile __near unsigned char  *)0x74)
#define VREFAMPCNT     (*(volatile __near unsigned char  *)0x75)
#define CLKDCTL        (*(volatile __near unsigned char  *)0x76)
#define CLKDCTL_bit    (*(volatile __near __bitf_T *)0x76)
#define CLKDEN0        (((volatile __near __bitf_T *)0x76)->no0)
#define CLKDEN1        (((volatile __near __bitf_T *)0x76)->no1)
#define PIOR0          (*(volatile __near unsigned char  *)0x77)
#define IAWCTL         (*(volatile __near unsigned char  *)0x78)
#define ADCKS          (*(volatile __near unsigned char  *)0x79)
#define FMCKS          (*(volatile __near unsigned char  *)0x7A)
#define FMCKS_bit      (*(volatile __near __bitf_T *)0x7A)
#define PMS            (*(volatile __near unsigned char  *)0x7B)
#define PMS_bit        (*(volatile __near __bitf_T *)0x7B)
#define DFLCTL         (*(volatile __near unsigned char  *)0x90)
#define DFLCTL_bit     (*(volatile __near __bitf_T *)0x90)
#define DFLEN          (((volatile __near __bitf_T *)0x90)->no0)
#define PCKC           (*(volatile __near unsigned char  *)0x98)
#define PCKC_bit       (*(volatile __near __bitf_T *)0x98)
#define DSADCK         (((volatile __near __bitf_T *)0x98)->no0)
#define PLLCK          (((volatile __near __bitf_T *)0x98)->no1)
#define HIOTRM         (*(volatile __near unsigned char  *)0xA0)
#define HOCODIV        (*(volatile __near unsigned char  *)0xA8)
#define FLMODE         (*(volatile __near unsigned char  *)0xAA)
#define FLMODE_bit     (*(volatile __near __bitf_T *)0xAA)
#define BANKPGEN       (((volatile __near __bitf_T *)0xAA)->no1)
#define MODE0          (((volatile __near __bitf_T *)0xAA)->no6)
#define MODE1          (((volatile __near __bitf_T *)0xAA)->no7)
#define FLMWRP         (*(volatile __near unsigned char  *)0xAB)
#define FLMWRP_bit     (*(volatile __near __bitf_T *)0xAB)
#define FLMWEN         (((volatile __near __bitf_T *)0xAB)->no0)
#define PER0           (*(volatile __near unsigned char  *)0xF0)
#define PER0_bit       (*(volatile __near __bitf_T *)0xF0)
#define TAU0EN         (((volatile __near __bitf_T *)0xF0)->no0)
#define SAU2EN         (((volatile __near __bitf_T *)0xF0)->no1)
#define SAU0EN         (((volatile __near __bitf_T *)0xF0)->no2)
#define SAU1EN         (((volatile __near __bitf_T *)0xF0)->no3)
#define IICA0EN        (((volatile __near __bitf_T *)0xF0)->no4)
#define ADCEN          (((volatile __near __bitf_T *)0xF0)->no5)
#define IRDAEN         (((volatile __near __bitf_T *)0xF0)->no6)
#define PRR0           (*(volatile __near unsigned char  *)0xF1)
#define PRR0_bit       (*(volatile __near __bitf_T *)0xF1)
#define TAU0RES        (((volatile __near __bitf_T *)0xF1)->no0)
#define SAU2RES        (((volatile __near __bitf_T *)0xF1)->no1)
#define SAU0RES        (((volatile __near __bitf_T *)0xF1)->no2)
#define SAU1RES        (((volatile __near __bitf_T *)0xF1)->no3)
#define IICA0RES       (((volatile __near __bitf_T *)0xF1)->no4)
#define ADCRES         (((volatile __near __bitf_T *)0xF1)->no5)
#define IRDARES        (((volatile __near __bitf_T *)0xF1)->no6)
#define MOCODIV        (*(volatile __near unsigned char  *)0xF2)
#define OSMC           (*(volatile __near unsigned char  *)0xF3)
#define OSMC_bit       (*(volatile __near __bitf_T *)0xF3)
#define WUTMMCK0       (((volatile __near __bitf_T *)0xF3)->no4)
#define RTCLPC         (((volatile __near __bitf_T *)0xF3)->no7)
#define RPECTL         (*(volatile __near unsigned char  *)0xF5)
#define RPECTL_bit     (*(volatile __near __bitf_T *)0xF5)
#define RPEF           (((volatile __near __bitf_T *)0xF5)->no0)
#define RPERDIS        (((volatile __near __bitf_T *)0xF5)->no7)
#define PMMC           (*(volatile __near unsigned char  *)0xF8)
#define PMMC_bit       (*(volatile __near __bitf_T *)0xF8)
#define MCSEL          (((volatile __near __bitf_T *)0xF8)->no6)
#define PORSR          (*(volatile __near unsigned char  *)0xF9)
#define PER1           (*(volatile __near unsigned char  *)0xFA)
#define PER1_bit       (*(volatile __near __bitf_T *)0xFA)
#define DSADCEN        (((volatile __near __bitf_T *)0xFA)->no0)
#define TRJ0EN         (((volatile __near __bitf_T *)0xFA)->no1)
#define TRJ1EN         (((volatile __near __bitf_T *)0xFA)->no2)
#define DTCEN          (((volatile __near __bitf_T *)0xFA)->no3)
#define SMOTD0EN       (((volatile __near __bitf_T *)0xFA)->no4)
#define SMOTD1EN       (((volatile __near __bitf_T *)0xFA)->no5)
#define FMCEN          (((volatile __near __bitf_T *)0xFA)->no6)
#define PRR1           (*(volatile __near unsigned char  *)0xFB)
#define PRR1_bit       (*(volatile __near __bitf_T *)0xFB)
#define DSADRES        (((volatile __near __bitf_T *)0xFB)->no0)
#define TRJ0RES        (((volatile __near __bitf_T *)0xFB)->no1)
#define TRJ1RES        (((volatile __near __bitf_T *)0xFB)->no2)
#define SMOTD0RES      (((volatile __near __bitf_T *)0xFB)->no4)
#define SMOTD1RES      (((volatile __near __bitf_T *)0xFB)->no5)
#define PER2           (*(volatile __near unsigned char  *)0xFC)
#define PER2_bit       (*(volatile __near __bitf_T *)0xFC)
#define VRTCEN         (((volatile __near __bitf_T *)0xFC)->no0)
#define MACEN          (((volatile __near __bitf_T *)0xFC)->no2)
#define UARTMG0EN      (((volatile __near __bitf_T *)0xFC)->no4)
#define UARTMG1EN      (((volatile __near __bitf_T *)0xFC)->no5)
#define OSDCEN         (((volatile __near __bitf_T *)0xFC)->no6)
#define TMKAEN         (((volatile __near __bitf_T *)0xFC)->no7)
#define PRR2           (*(volatile __near unsigned char  *)0xFD)
#define PRR2_bit       (*(volatile __near __bitf_T *)0xFD)
#define MACRES         (((volatile __near __bitf_T *)0xFD)->no2)
#define UARTMG0RES     (((volatile __near __bitf_T *)0xFD)->no4)
#define UARTMG1RES     (((volatile __near __bitf_T *)0xFD)->no5)
#define OSDCRES        (((volatile __near __bitf_T *)0xFD)->no6)
#define TMKARES        (((volatile __near __bitf_T *)0xFD)->no7)
#define BCDADJ         (*(volatile __near unsigned char  *)0xFE)
#define SSR00          (*(volatile __near unsigned short *)0x100)
#define SSR00L         (*(volatile __near unsigned char  *)0x100)
#define SSR01          (*(volatile __near unsigned short *)0x102)
#define SSR01L         (*(volatile __near unsigned char  *)0x102)
#define SSR02          (*(volatile __near unsigned short *)0x104)
#define SSR02L         (*(volatile __near unsigned char  *)0x104)
#define SSR03          (*(volatile __near unsigned short *)0x106)
#define SSR03L         (*(volatile __near unsigned char  *)0x106)
#define SIR00          (*(volatile __near unsigned short *)0x108)
#define SIR00L         (*(volatile __near unsigned char  *)0x108)
#define SIR01          (*(volatile __near unsigned short *)0x10A)
#define SIR01L         (*(volatile __near unsigned char  *)0x10A)
#define SIR02          (*(volatile __near unsigned short *)0x10C)
#define SIR02L         (*(volatile __near unsigned char  *)0x10C)
#define SIR03          (*(volatile __near unsigned short *)0x10E)
#define SIR03L         (*(volatile __near unsigned char  *)0x10E)
#define SMR00          (*(volatile __near unsigned short *)0x110)
#define SMR01          (*(volatile __near unsigned short *)0x112)
#define SMR02          (*(volatile __near unsigned short *)0x114)
#define SMR03          (*(volatile __near unsigned short *)0x116)
#define SCR00          (*(volatile __near unsigned short *)0x118)
#define SCR01          (*(volatile __near unsigned short *)0x11A)
#define SCR02          (*(volatile __near unsigned short *)0x11C)
#define SCR03          (*(volatile __near unsigned short *)0x11E)
#define SE0            (*(volatile __near unsigned short *)0x120)
#define SE0L           (*(volatile __near unsigned char  *)0x120)
#define SE0L_bit       (*(volatile __near __bitf_T *)0x120)
#define SS0            (*(volatile __near unsigned short *)0x122)
#define SS0L           (*(volatile __near unsigned char  *)0x122)
#define SS0L_bit       (*(volatile __near __bitf_T *)0x122)
#define ST0            (*(volatile __near unsigned short *)0x124)
#define ST0L           (*(volatile __near unsigned char  *)0x124)
#define ST0L_bit       (*(volatile __near __bitf_T *)0x124)
#define SPS0           (*(volatile __near unsigned short *)0x126)
#define SPS0L          (*(volatile __near unsigned char  *)0x126)
#define SO0            (*(volatile __near unsigned short *)0x128)
#define SOE0           (*(volatile __near unsigned short *)0x12A)
#define SOE0L          (*(volatile __near unsigned char  *)0x12A)
#define SOE0L_bit      (*(volatile __near __bitf_T *)0x12A)
#define SOL0           (*(volatile __near unsigned short *)0x134)
#define SOL0L          (*(volatile __near unsigned char  *)0x134)
#define SSC0           (*(volatile __near unsigned short *)0x138)
#define SSC0L          (*(volatile __near unsigned char  *)0x138)
#define SSR10          (*(volatile __near unsigned short *)0x140)
#define SSR10L         (*(volatile __near unsigned char  *)0x140)
#define SSR11          (*(volatile __near unsigned short *)0x142)
#define SSR11L         (*(volatile __near unsigned char  *)0x142)
#define SSR12          (*(volatile __near unsigned short *)0x144)
#define SSR12L         (*(volatile __near unsigned char  *)0x144)
#define SSR13          (*(volatile __near unsigned short *)0x146)
#define SSR13L         (*(volatile __near unsigned char  *)0x146)
#define SIR10          (*(volatile __near unsigned short *)0x148)
#define SIR10L         (*(volatile __near unsigned char  *)0x148)
#define SIR11          (*(volatile __near unsigned short *)0x14A)
#define SIR11L         (*(volatile __near unsigned char  *)0x14A)
#define SIR12          (*(volatile __near unsigned short *)0x14C)
#define SIR12L         (*(volatile __near unsigned char  *)0x14C)
#define SIR13          (*(volatile __near unsigned short *)0x14E)
#define SIR13L         (*(volatile __near unsigned char  *)0x14E)
#define SMR10          (*(volatile __near unsigned short *)0x150)
#define SMR11          (*(volatile __near unsigned short *)0x152)
#define SMR12          (*(volatile __near unsigned short *)0x154)
#define SMR13          (*(volatile __near unsigned short *)0x156)
#define SCR10          (*(volatile __near unsigned short *)0x158)
#define SCR11          (*(volatile __near unsigned short *)0x15A)
#define SCR12          (*(volatile __near unsigned short *)0x15C)
#define SCR13          (*(volatile __near unsigned short *)0x15E)
#define SE1            (*(volatile __near unsigned short *)0x160)
#define SE1L           (*(volatile __near unsigned char  *)0x160)
#define SE1L_bit       (*(volatile __near __bitf_T *)0x160)
#define SS1            (*(volatile __near unsigned short *)0x162)
#define SS1L           (*(volatile __near unsigned char  *)0x162)
#define SS1L_bit       (*(volatile __near __bitf_T *)0x162)
#define ST1            (*(volatile __near unsigned short *)0x164)
#define ST1L           (*(volatile __near unsigned char  *)0x164)
#define ST1L_bit       (*(volatile __near __bitf_T *)0x164)
#define SPS1           (*(volatile __near unsigned short *)0x166)
#define SPS1L          (*(volatile __near unsigned char  *)0x166)
#define SO1            (*(volatile __near unsigned short *)0x168)
#define SOE1           (*(volatile __near unsigned short *)0x16A)
#define SOE1L          (*(volatile __near unsigned char  *)0x16A)
#define SOE1L_bit      (*(volatile __near __bitf_T *)0x16A)
#define SOL1           (*(volatile __near unsigned short *)0x174)
#define SOL1L          (*(volatile __near unsigned char  *)0x174)
#define TCR00          (*(volatile __near unsigned short *)0x180)
#define TCR01          (*(volatile __near unsigned short *)0x182)
#define TCR02          (*(volatile __near unsigned short *)0x184)
#define TCR03          (*(volatile __near unsigned short *)0x186)
#define TCR04          (*(volatile __near unsigned short *)0x188)
#define TCR05          (*(volatile __near unsigned short *)0x18A)
#define TCR06          (*(volatile __near unsigned short *)0x18C)
#define TCR07          (*(volatile __near unsigned short *)0x18E)
#define TMR00          (*(volatile __near unsigned short *)0x190)
#define TMR01          (*(volatile __near unsigned short *)0x192)
#define TMR02          (*(volatile __near unsigned short *)0x194)
#define TMR03          (*(volatile __near unsigned short *)0x196)
#define TMR04          (*(volatile __near unsigned short *)0x198)
#define TMR05          (*(volatile __near unsigned short *)0x19A)
#define TMR06          (*(volatile __near unsigned short *)0x19C)
#define TMR07          (*(volatile __near unsigned short *)0x19E)
#define TSR00          (*(volatile __near unsigned short *)0x1A0)
#define TSR00L         (*(volatile __near unsigned char  *)0x1A0)
#define TSR01          (*(volatile __near unsigned short *)0x1A2)
#define TSR01L         (*(volatile __near unsigned char  *)0x1A2)
#define TSR02          (*(volatile __near unsigned short *)0x1A4)
#define TSR02L         (*(volatile __near unsigned char  *)0x1A4)
#define TSR03          (*(volatile __near unsigned short *)0x1A6)
#define TSR03L         (*(volatile __near unsigned char  *)0x1A6)
#define TSR04          (*(volatile __near unsigned short *)0x1A8)
#define TSR04L         (*(volatile __near unsigned char  *)0x1A8)
#define TSR05          (*(volatile __near unsigned short *)0x1AA)
#define TSR05L         (*(volatile __near unsigned char  *)0x1AA)
#define TSR06          (*(volatile __near unsigned short *)0x1AC)
#define TSR06L         (*(volatile __near unsigned char  *)0x1AC)
#define TSR07          (*(volatile __near unsigned short *)0x1AE)
#define TSR07L         (*(volatile __near unsigned char  *)0x1AE)
#define TE0            (*(volatile __near unsigned short *)0x1B0)
#define TE0L           (*(volatile __near unsigned char  *)0x1B0)
#define TE0L_bit       (*(volatile __near __bitf_T *)0x1B0)
#define TS0            (*(volatile __near unsigned short *)0x1B2)
#define TS0L           (*(volatile __near unsigned char  *)0x1B2)
#define TS0L_bit       (*(volatile __near __bitf_T *)0x1B2)
#define TT0            (*(volatile __near unsigned short *)0x1B4)
#define TT0L           (*(volatile __near unsigned char  *)0x1B4)
#define TT0L_bit       (*(volatile __near __bitf_T *)0x1B4)
#define TPS0           (*(volatile __near unsigned short *)0x1B6)
#define TO0            (*(volatile __near unsigned short *)0x1B8)
#define TO0L           (*(volatile __near unsigned char  *)0x1B8)
#define TOE0           (*(volatile __near unsigned short *)0x1BA)
#define TOE0L          (*(volatile __near unsigned char  *)0x1BA)
#define TOE0L_bit      (*(volatile __near __bitf_T *)0x1BA)
#define TOL0           (*(volatile __near unsigned short *)0x1BC)
#define TOL0L          (*(volatile __near unsigned char  *)0x1BC)
#define TOM0           (*(volatile __near unsigned short *)0x1BE)
#define TOM0L          (*(volatile __near unsigned char  *)0x1BE)
#define SSR20          (*(volatile __near unsigned short *)0x1C0)
#define SSR20L         (*(volatile __near unsigned char  *)0x1C0)
#define SSR21          (*(volatile __near unsigned short *)0x1C2)
#define SSR21L         (*(volatile __near unsigned char  *)0x1C2)
#define SIR20          (*(volatile __near unsigned short *)0x1C8)
#define SIR20L         (*(volatile __near unsigned char  *)0x1C8)
#define SIR21          (*(volatile __near unsigned short *)0x1CA)
#define SIR21L         (*(volatile __near unsigned char  *)0x1CA)
#define SMR20          (*(volatile __near unsigned short *)0x1D0)
#define SMR21          (*(volatile __near unsigned short *)0x1D2)
#define SCR20          (*(volatile __near unsigned short *)0x1D8)
#define SCR21          (*(volatile __near unsigned short *)0x1DA)
#define SE2            (*(volatile __near unsigned short *)0x1E0)
#define SE2L           (*(volatile __near unsigned char  *)0x1E0)
#define SE2L_bit       (*(volatile __near __bitf_T *)0x1E0)
#define SS2            (*(volatile __near unsigned short *)0x1E2)
#define SS2L           (*(volatile __near unsigned char  *)0x1E2)
#define SS2L_bit       (*(volatile __near __bitf_T *)0x1E2)
#define ST2            (*(volatile __near unsigned short *)0x1E4)
#define ST2L           (*(volatile __near unsigned char  *)0x1E4)
#define ST2L_bit       (*(volatile __near __bitf_T *)0x1E4)
#define SPS2           (*(volatile __near unsigned short *)0x1E6)
#define SPS2L          (*(volatile __near unsigned char  *)0x1E6)
#define SO2            (*(volatile __near unsigned short *)0x1E8)
#define SOE2           (*(volatile __near unsigned short *)0x1EA)
#define SOE2L          (*(volatile __near unsigned char  *)0x1EA)
#define SOE2L_bit      (*(volatile __near __bitf_T *)0x1EA)
#define SOL2           (*(volatile __near unsigned short *)0x1F4)
#define SOL2L          (*(volatile __near unsigned char  *)0x1F4)
#define TXBMG0         (*(volatile __near unsigned char  *)0x210)
#define RXBMG0         (*(volatile __near unsigned char  *)0x211)
#define ASIMMG00       (*(volatile __near unsigned char  *)0x212)
#define ASIMMG00_bit   (*(volatile __near __bitf_T *)0x212)
#define ISRMMG0        (((volatile __near __bitf_T *)0x212)->no0)
#define ISSMMG0        (((volatile __near __bitf_T *)0x212)->no1)
#define RXEMG0         (((volatile __near __bitf_T *)0x212)->no5)
#define TXEMG0         (((volatile __near __bitf_T *)0x212)->no6)
#define POWERMG0       (((volatile __near __bitf_T *)0x212)->no7)
#define ASIMMG01       (*(volatile __near unsigned char  *)0x213)
#define ASIMMG01_bit   (*(volatile __near __bitf_T *)0x213)
#define BRGCMG0        (*(volatile __near unsigned char  *)0x214)
#define ASISMG0        (*(volatile __near unsigned char  *)0x215)
#define ASCTMG0        (*(volatile __near unsigned char  *)0x216)
#define ASCTMG0_bit    (*(volatile __near __bitf_T *)0x216)
#define OVECTMG0       (((volatile __near __bitf_T *)0x216)->no0)
