Tejaswini-KR/3-Phase-Smart-Meter/Source/rl78i1c/application/modbus/iodefine.h
#define FECTMG0        (((volatile __near __bitf_T *)0x216)->no1)
#define PECTMG0        (((volatile __near __bitf_T *)0x216)->no2)
#define TXBMG1         (*(volatile __near unsigned char  *)0x218)
#define RXBMG1         (*(volatile __near unsigned char  *)0x219)
#define ASIMMG10       (*(volatile __near unsigned char  *)0x21A)
#define ASIMMG10_bit   (*(volatile __near __bitf_T *)0x21A)
#define ISRMMG1        (((volatile __near __bitf_T *)0x21A)->no0)
#define ISSMMG1        (((volatile __near __bitf_T *)0x21A)->no1)
#define RXEMG1         (((volatile __near __bitf_T *)0x21A)->no5)
#define TXEMG1         (((volatile __near __bitf_T *)0x21A)->no6)
#define POWERMG1       (((volatile __near __bitf_T *)0x21A)->no7)
#define ASIMMG11       (*(volatile __near unsigned char  *)0x21B)
#define ASIMMG11_bit   (*(volatile __near __bitf_T *)0x21B)
#define BRGCMG1        (*(volatile __near unsigned char  *)0x21C)
#define ASISMG1        (*(volatile __near unsigned char  *)0x21D)
#define ASCTMG1        (*(volatile __near unsigned char  *)0x21E)
#define ASCTMG1_bit    (*(volatile __near __bitf_T *)0x21E)
#define OVECTMG1       (((volatile __near __bitf_T *)0x21E)->no0)
#define FECTMG1        (((volatile __near __bitf_T *)0x21E)->no1)
#define PECTMG1        (((volatile __near __bitf_T *)0x21E)->no2)
#define IICCTL00       (*(volatile __near unsigned char  *)0x230)
#define IICCTL00_bit   (*(volatile __near __bitf_T *)0x230)
#define SPT0           (((volatile __near __bitf_T *)0x230)->no0)
#define STT0           (((volatile __near __bitf_T *)0x230)->no1)
#define ACKE0          (((volatile __near __bitf_T *)0x230)->no2)
#define WTIM0          (((volatile __near __bitf_T *)0x230)->no3)
#define SPIE0          (((volatile __near __bitf_T *)0x230)->no4)
#define WREL0          (((volatile __near __bitf_T *)0x230)->no5)
#define LREL0          (((volatile __near __bitf_T *)0x230)->no6)
#define IICE0          (((volatile __near __bitf_T *)0x230)->no7)
#define IICCTL01       (*(volatile __near unsigned char  *)0x231)
#define IICCTL01_bit   (*(volatile __near __bitf_T *)0x231)
#define PRS0           (((volatile __near __bitf_T *)0x231)->no0)
#define DFC0           (((volatile __near __bitf_T *)0x231)->no2)
#define SMC0           (((volatile __near __bitf_T *)0x231)->no3)
#define DAD0           (((volatile __near __bitf_T *)0x231)->no4)
#define CLD0           (((volatile __near __bitf_T *)0x231)->no5)
#define WUP0           (((volatile __near __bitf_T *)0x231)->no7)
#define IICWL0         (*(volatile __near unsigned char  *)0x232)
#define IICWH0         (*(volatile __near unsigned char  *)0x233)
#define SVA0           (*(volatile __near unsigned char  *)0x234)
#define ELSELR00       (*(volatile __near unsigned char  *)0x240)
#define ELSELR01       (*(volatile __near unsigned char  *)0x241)
#define ELSELR02       (*(volatile __near unsigned char  *)0x242)
#define ELSELR03       (*(volatile __near unsigned char  *)0x243)
#define ELSELR04       (*(volatile __near unsigned char  *)0x244)
#define ELSELR05       (*(volatile __near unsigned char  *)0x245)
#define ELSELR06       (*(volatile __near unsigned char  *)0x246)
#define ELSELR07       (*(volatile __near unsigned char  *)0x247)
#define ELSELR08       (*(volatile __near unsigned char  *)0x248)
#define ELSELR09       (*(volatile __near unsigned char  *)0x249)
#define ELSELR10       (*(volatile __near unsigned char  *)0x24A)
#define ELSELR11       (*(volatile __near unsigned char  *)0x24B)
#define ELSELR12       (*(volatile __near unsigned char  *)0x24C)
#define ELSELR13       (*(volatile __near unsigned char  *)0x24D)
#define ELSELR14       (*(volatile __near unsigned char  *)0x24E)
#define ELSELR15       (*(volatile __near unsigned char  *)0x24F)
#define ELSELR16       (*(volatile __near unsigned char  *)0x250)
#define ELSELR17       (*(volatile __near unsigned char  *)0x251)
#define ELSELR18       (*(volatile __near unsigned char  *)0x252)
#define ELSELR19       (*(volatile __near unsigned char  *)0x253)
#define ELSELR20       (*(volatile __near unsigned char  *)0x254)
#define ELSELR21       (*(volatile __near unsigned char  *)0x255)
#define ELSELR22       (*(volatile __near unsigned char  *)0x256)
#define ELSELR23       (*(volatile __near unsigned char  *)0x257)
#define ELSELR24       (*(volatile __near unsigned char  *)0x258)
#define ELSELR25       (*(volatile __near unsigned char  *)0x259)
#define ELSELR26       (*(volatile __near unsigned char  *)0x25A)
#define ELSELR27       (*(volatile __near unsigned char  *)0x25B)
#define ELSELR28       (*(volatile __near unsigned char  *)0x25C)
#define ELSELR29       (*(volatile __near unsigned char  *)0x25D)
#define MUL32UL        (*(volatile __near unsigned short *)0x280)
#define MUL32UH        (*(volatile __near unsigned short *)0x282)
#define MUL32SL        (*(volatile __near unsigned short *)0x284)
#define MUL32SH        (*(volatile __near unsigned short *)0x286)
#define MAC32UL        (*(volatile __near unsigned short *)0x288)
#define MAC32UH        (*(volatile __near unsigned short *)0x28A)
#define MAC32SL        (*(volatile __near unsigned short *)0x28C)
#define MAC32SH        (*(volatile __near unsigned short *)0x28E)
#define MULR0          (*(volatile __near unsigned short *)0x290)
#define MULR1          (*(volatile __near unsigned short *)0x292)
#define MULR2          (*(volatile __near unsigned short *)0x294)
#define MULR3          (*(volatile __near unsigned short *)0x296)
#define MULC           (*(volatile __near unsigned char  *)0x29A)
#define MULC_bit       (*(volatile __near __bitf_T *)0x29A)
#define MULST          (((volatile __near __bitf_T *)0x29A)->no0)
#define MACSF          (((volatile __near __bitf_T *)0x29A)->no1)
#define MACOF          (((volatile __near __bitf_T *)0x29A)->no2)
#define MULFRAC        (((volatile __near __bitf_T *)0x29A)->no4)
#define MULSM          (((volatile __near __bitf_T *)0x29A)->no6)
#define MACMODE        (((volatile __near __bitf_T *)0x29A)->no7)
#define MULRSEL        (*(volatile __near unsigned char  *)0x29B)
#define MULRSEL_bit    (*(volatile __near __bitf_T *)0x29B)
#define MULRSELINC     (((volatile __near __bitf_T *)0x29B)->no7)
#define TRJCR0         (*(volatile __near unsigned char  *)0x2A0)
#define TRJIOC0        (*(volatile __near unsigned char  *)0x2A1)
#define TRJIOC0_bit    (*(volatile __near __bitf_T *)0x2A1)
#define TRJMR0         (*(volatile __near unsigned char  *)0x2A2)
#define TRJMR0_bit     (*(volatile __near __bitf_T *)0x2A2)
#define TRJISR0        (*(volatile __near unsigned char  *)0x2A3)
#define TRJISR0_bit    (*(volatile __near __bitf_T *)0x2A3)
#define TRJCR1         (*(volatile __near unsigned char  *)0x2A4)
#define TRJIOC1        (*(volatile __near unsigned char  *)0x2A5)
#define TRJIOC1_bit    (*(volatile __near __bitf_T *)0x2A5)
#define TRJMR1         (*(volatile __near unsigned char  *)0x2A6)
#define TRJMR1_bit     (*(volatile __near __bitf_T *)0x2A6)
#define TRJISR1        (*(volatile __near unsigned char  *)0x2A7)
#define TRJISR1_bit    (*(volatile __near __bitf_T *)0x2A7)
#define SMOTDCRSA0     (*(volatile __near unsigned char  *)0x2B0)
#define SMOTDCRSB0     (*(volatile __near unsigned char  *)0x2B1)
#define SMOTDTCS0      (*(volatile __near unsigned char  *)0x2B2)
#define SMOTDCR0       (*(volatile __near unsigned char  *)0x2B3)
#define SMOTDCR0_bit   (*(volatile __near __bitf_T *)0x2B3)
#define SMOTDTCE0      (((volatile __near __bitf_T *)0x2B3)->no0)
#define SMOTDPOL0      (((volatile __near __bitf_T *)0x2B3)->no4)
#define SMOTDSMS0      (*(volatile __near unsigned char  *)0x2B4)
#define SMOTDSMS0_bit  (*(volatile __near __bitf_T *)0x2B4)
#define SMOTDSMS00     (((volatile __near __bitf_T *)0x2B4)->no0)
#define SMOTDSMS01     (((volatile __near __bitf_T *)0x2B4)->no1)
#define SMOTDSMS02     (((volatile __near __bitf_T *)0x2B4)->no2)
#define SMOTDSMS03     (((volatile __near __bitf_T *)0x2B4)->no3)
#define SMOTDSMS04     (((volatile __near __bitf_T *)0x2B4)->no4)
#define SMOTDSMS05     (((volatile __near __bitf_T *)0x2B4)->no5)
#define SMOTDSMD0      (*(volatile __near unsigned char  *)0x2B5)
#define SMOTDSMD0_bit  (*(volatile __near __bitf_T *)0x2B5)
#define SMOTDSMD00     (((volatile __near __bitf_T *)0x2B5)->no0)
#define SMOTDSMD01     (((volatile __near __bitf_T *)0x2B5)->no1)
#define SMOTDSMD02     (((volatile __near __bitf_T *)0x2B5)->no2)
#define SMOTDSMD03     (((volatile __near __bitf_T *)0x2B5)->no3)
#define SMOTDSMD04     (((volatile __near __bitf_T *)0x2B5)->no4)
#define SMOTDSMD05     (((volatile __near __bitf_T *)0x2B5)->no5)
#define SMOTDOE0       (*(volatile __near unsigned char  *)0x2B6)
#define SMOTDOE0_bit   (*(volatile __near __bitf_T *)0x2B6)
#define SMOTDOE00      (((volatile __near __bitf_T *)0x2B6)->no0)
#define SMOTDOE01      (((volatile __near __bitf_T *)0x2B6)->no1)
#define SMOTDOE02      (((volatile __near __bitf_T *)0x2B6)->no2)
#define SMOTDCRSA1     (*(volatile __near unsigned char  *)0x2B8)
#define SMOTDCRSB1     (*(volatile __near unsigned char  *)0x2B9)
#define SMOTDTCS1      (*(volatile __near unsigned char  *)0x2BA)
#define SMOTDCR1       (*(volatile __near unsigned char  *)0x2BB)
#define SMOTDCR1_bit   (*(volatile __near __bitf_T *)0x2BB)
#define SMOTDTCE1      (((volatile __near __bitf_T *)0x2BB)->no0)
#define SMOTDPOL1      (((volatile __near __bitf_T *)0x2BB)->no4)
#define SMOTDSMS1      (*(volatile __near unsigned char  *)0x2BC)
#define SMOTDSMS1_bit  (*(volatile __near __bitf_T *)0x2BC)
#define SMOTDSMS10     (((volatile __near __bitf_T *)0x2BC)->no0)
#define SMOTDSMS11     (((volatile __near __bitf_T *)0x2BC)->no1)
#define SMOTDSMS12     (((volatile __near __bitf_T *)0x2BC)->no2)
#define SMOTDSMS13     (((volatile __near __bitf_T *)0x2BC)->no3)
#define SMOTDSMS14     (((volatile __near __bitf_T *)0x2BC)->no4)
#define SMOTDSMS15     (((volatile __near __bitf_T *)0x2BC)->no5)
#define SMOTDSMD1      (*(volatile __near unsigned char  *)0x2BD)
#define SMOTDSMD1_bit  (*(volatile __near __bitf_T *)0x2BD)
#define SMOTDSMD10     (((volatile __near __bitf_T *)0x2BD)->no0)
#define SMOTDSMD11     (((volatile __near __bitf_T *)0x2BD)->no1)
#define SMOTDSMD12     (((volatile __near __bitf_T *)0x2BD)->no2)
#define SMOTDSMD13     (((volatile __near __bitf_T *)0x2BD)->no3)
#define SMOTDSMD14     (((volatile __near __bitf_T *)0x2BD)->no4)
#define SMOTDSMD15     (((volatile __near __bitf_T *)0x2BD)->no5)
#define SMOTDOE1       (*(volatile __near unsigned char  *)0x2BE)
#define SMOTDOE1_bit   (*(volatile __near __bitf_T *)0x2BE)
#define SMOTDOE10      (((volatile __near __bitf_T *)0x2BE)->no0)
#define SMOTDOE11      (((volatile __near __bitf_T *)0x2BE)->no1)
#define SMOTDOE12      (((volatile __near __bitf_T *)0x2BE)->no2)
#define OSDC           (*(volatile __near unsigned short *)0x2D0)
#define HOCOFC         (*(volatile __near unsigned char  *)0x2D8)
#define CRFTRIM        (*(volatile __near unsigned char  *)0x2D9)
#define DTCBAR         (*(volatile __near unsigned char  *)0x2E0)
#define DSCCTL         (*(volatile __near unsigned char  *)0x2E5)
#define DSCCTL_bit     (*(volatile __near __bitf_T *)0x2E5)
#define MCKC           (*(volatile __near unsigned char  *)0x2E6)
#define MCKC_bit       (*(volatile __near __bitf_T *)0x2E6)
#define DTCEN0         (*(volatile __near unsigned char  *)0x2E8)
#define DTCEN0_bit     (*(volatile __near __bitf_T *)0x2E8)
#define DTCEN00        (((volatile __near __bitf_T *)0x2E8)->no0)
#define DTCEN01        (((volatile __near __bitf_T *)0x2E8)->no1)
#define DTCEN02        (((volatile __near __bitf_T *)0x2E8)->no2)
#define DTCEN03        (((volatile __near __bitf_T *)0x2E8)->no3)
#define DTCEN04        (((volatile __near __bitf_T *)0x2E8)->no4)
#define DTCEN05        (((volatile __near __bitf_T *)0x2E8)->no5)
#define DTCEN06        (((volatile __near __bitf_T *)0x2E8)->no6)
#define DTCEN07        (((volatile __near __bitf_T *)0x2E8)->no7)
#define DTCEN1         (*(volatile __near unsigned char  *)0x2E9)
#define DTCEN1_bit     (*(volatile __near __bitf_T *)0x2E9)
#define DTCEN10        (((volatile __near __bitf_T *)0x2E9)->no0)
#define DTCEN11        (((volatile __near __bitf_T *)0x2E9)->no1)
#define DTCEN12        (((volatile __near __bitf_T *)0x2E9)->no2)
#define DTCEN13        (((volatile __near __bitf_T *)0x2E9)->no3)
#define DTCEN14        (((volatile __near __bitf_T *)0x2E9)->no4)
#define DTCEN15        (((volatile __near __bitf_T *)0x2E9)->no5)
#define DTCEN16        (((volatile __near __bitf_T *)0x2E9)->no6)
#define DTCEN17        (((volatile __near __bitf_T *)0x2E9)->no7)
#define DTCEN2         (*(volatile __near unsigned char  *)0x2EA)
#define DTCEN2_bit     (*(volatile __near __bitf_T *)0x2EA)
#define DTCEN20        (((volatile __near __bitf_T *)0x2EA)->no0)
#define DTCEN21        (((volatile __near __bitf_T *)0x2EA)->no1)
#define DTCEN22        (((volatile __near __bitf_T *)0x2EA)->no2)
#define DTCEN23        (((volatile __near __bitf_T *)0x2EA)->no3)
#define DTCEN24        (((volatile __near __bitf_T *)0x2EA)->no4)
#define DTCEN25        (((volatile __near __bitf_T *)0x2EA)->no5)
#define DTCEN26        (((volatile __near __bitf_T *)0x2EA)->no6)
#define DTCEN27        (((volatile __near __bitf_T *)0x2EA)->no7)
#define DTCEN3         (*(volatile __near unsigned char  *)0x2EB)
#define DTCEN3_bit     (*(volatile __near __bitf_T *)0x2EB)
#define DTCEN30        (((volatile __near __bitf_T *)0x2EB)->no0)
#define DTCEN31        (((volatile __near __bitf_T *)0x2EB)->no1)
#define DTCEN32        (((volatile __near __bitf_T *)0x2EB)->no2)
#define DTCEN33        (((volatile __near __bitf_T *)0x2EB)->no3)
#define DTCEN34        (((volatile __near __bitf_T *)0x2EB)->no4)
#define DTCEN35        (((volatile __near __bitf_T *)0x2EB)->no5)
#define DTCEN36        (((volatile __near __bitf_T *)0x2EB)->no6)
#define DTCEN37        (((volatile __near __bitf_T *)0x2EB)->no7)
#define DTCEN4         (*(volatile __near unsigned char  *)0x2EC)
#define DTCEN4_bit     (*(volatile __near __bitf_T *)0x2EC)
#define DTCEN40        (((volatile __near __bitf_T *)0x2EC)->no0)
#define DTCEN41        (((volatile __near __bitf_T *)0x2EC)->no1)
#define DTCEN42        (((volatile __near __bitf_T *)0x2EC)->no2)
#define DTCEN43        (((volatile __near __bitf_T *)0x2EC)->no3)
#define DTCEN44        (((volatile __near __bitf_T *)0x2EC)->no4)
#define DTCEN45        (((volatile __near __bitf_T *)0x2EC)->no5)
#define DTCEN46        (((volatile __near __bitf_T *)0x2EC)->no6)
#define DTCEN47        (((volatile __near __bitf_T *)0x2EC)->no7)
#define DTCEN5         (*(volatile __near unsigned char  *)0x2ED)
#define DTCEN5_bit     (*(volatile __near __bitf_T *)0x2ED)
#define DTCEN50        (((volatile __near __bitf_T *)0x2ED)->no0)
#define DTCEN51        (((volatile __near __bitf_T *)0x2ED)->no1)
#define DTCEN52        (((volatile __near __bitf_T *)0x2ED)->no2)
#define DTCEN53        (((volatile __near __bitf_T *)0x2ED)->no3)
#define DTCEN54        (((volatile __near __bitf_T *)0x2ED)->no4)
#define DTCEN55        (((volatile __near __bitf_T *)0x2ED)->no5)
#define DTCEN56        (((volatile __near __bitf_T *)0x2ED)->no6)
#define DTCEN57        (((volatile __near __bitf_T *)0x2ED)->no7)
#define DTCEN6         (*(volatile __near unsigned char  *)0x2EE)
#define DTCEN6_bit     (*(volatile __near __bitf_T *)0x2EE)
#define DTCEN60        (((volatile __near __bitf_T *)0x2EE)->no0)
#define DTCEN61        (((volatile __near __bitf_T *)0x2EE)->no1)
#define DTCEN62        (((volatile __near __bitf_T *)0x2EE)->no2)
#define DTCEN63        (((volatile __near __bitf_T *)0x2EE)->no3)
#define DTCEN64        (((volatile __near __bitf_T *)0x2EE)->no4)
#define DTCEN65        (((volatile __near __bitf_T *)0x2EE)->no5)
#define DTCEN66        (((volatile __near __bitf_T *)0x2EE)->no6)
#define DTCEN67        (((volatile __near __bitf_T *)0x2EE)->no7)
#define CRC0CTL        (*(volatile __near unsigned char  *)0x2F0)
#define CRC0CTL_bit    (*(volatile __near __bitf_T *)0x2F0)
#define CRC0EN         (((volatile __near __bitf_T *)0x2F0)->no7)
#define PGCRCL         (*(volatile __near unsigned short *)0x2F2)
#define CRCD           (*(volatile __near unsigned short *)0x2FA)
#define PFSEG0         (*(volatile __near unsigned char  *)0x300)
#define PFSEG0_bit     (*(volatile __near __bitf_T *)0x300)
#define PFSEG1         (*(volatile __near unsigned char  *)0x301)
#define PFSEG1_bit     (*(volatile __near __bitf_T *)0x301)
#define PFSEG2         (*(volatile __near unsigned char  *)0x302)
#define PFSEG2_bit     (*(volatile __near __bitf_T *)0x302)
#define PFSEG3         (*(volatile __near unsigned char  *)0x303)
#define PFSEG3_bit     (*(volatile __near __bitf_T *)0x303)
#define PFSEG4         (*(volatile __near unsigned char  *)0x304)
#define PFSEG4_bit     (*(volatile __near __bitf_T *)0x304)
#define PFSEG5         (*(volatile __near unsigned char  *)0x305)
#define PFSEG5_bit     (*(volatile __near __bitf_T *)0x305)
#define PFSEG6         (*(volatile __near unsigned char  *)0x306)
#define PFSEG6_bit     (*(volatile __near __bitf_T *)0x306)
#define ISCLCD         (*(volatile __near unsigned char  *)0x308)
#define ISCLCD_bit     (*(volatile __near __bitf_T *)0x308)
#define FMCRL          (*(volatile __near unsigned short *)0x312)
#define FMCRH          (*(volatile __near unsigned short *)0x314)
#define FMCTL          (*(volatile __near unsigned char  *)0x316)
#define FMCTL_bit      (*(volatile __near __bitf_T *)0x316)
#define FMS            (((volatile __near __bitf_T *)0x316)->no7)
#define LVDVDD         (*(volatile __near unsigned char  *)0x332)
#define LVDVDD_bit     (*(volatile __near __bitf_T *)0x332)
#define LVDVDDF        (((volatile __near __bitf_T *)0x332)->no6)
#define LVDVDDEN       (((volatile __near __bitf_T *)0x332)->no7)
#define LVDVBAT        (*(volatile __near unsigned char  *)0x333)
#define LVDVBAT_bit    (*(volatile __near __bitf_T *)0x333)
#define LVDVBATF       (((volatile __near __bitf_T *)0x333)->no6)
#define LVDVBATEN      (((volatile __near __bitf_T *)0x333)->no7)
#define LVDVRTC        (*(volatile __near unsigned char  *)0x334)
#define LVDVRTC_bit    (*(volatile __near __bitf_T *)0x334)
#define LVDVRTCF       (((volatile __near __bitf_T *)0x334)->no6)
#define LVDVRTCEN      (((volatile __near __bitf_T *)0x334)->no7)
#define LVDEXLVD       (*(volatile __near unsigned char  *)0x335)
#define LVDEXLVD_bit   (*(volatile __near __bitf_T *)0x335)
#define LVDEXLVDF      (((volatile __near __bitf_T *)0x335)->no6)
#define LVDEXLVDEN     (((volatile __near __bitf_T *)0x335)->no7)
#define TRTCMP0        (*(volatile __near unsigned short *)0x350)
#define TRTCMP00       (*(volatile __near unsigned char  *)0x350)
#define TRTCMP01       (*(volatile __near unsigned char  *)0x351)
#define TRTCR0         (*(volatile __near unsigned char  *)0x352)
#define TRTCR0_bit     (*(volatile __near __bitf_T *)0x352)
#define TSTART00       (((volatile __near __bitf_T *)0x352)->no0)
#define TSTART01       (((volatile __near __bitf_T *)0x352)->no2)
#define TRTMD0         (*(volatile __near unsigned char  *)0x353)
#define TRTCMP1        (*(volatile __near unsigned short *)0x358)
#define TRTCMP10       (*(volatile __near unsigned char  *)0x358)
#define TRTCMP11       (*(volatile __near unsigned char  *)0x359)
#define TRTCR1         (*(volatile __near unsigned char  *)0x35A)
#define TRTCR1_bit     (*(volatile __near __bitf_T *)0x35A)
#define TSTART10       (((volatile __near __bitf_T *)0x35A)->no0)
#define TSTART11       (((volatile __near __bitf_T *)0x35A)->no2)
#define TRTMD1         (*(volatile __near unsigned char  *)0x35B)
#define TRTCMP2        (*(volatile __near unsigned short *)0x360)
#define TRTCMP20       (*(volatile __near unsigned char  *)0x360)
#define TRTCMP21       (*(volatile __near unsigned char  *)0x361)
#define TRTCR2         (*(volatile __near unsigned char  *)0x362)
#define TRTCR2_bit     (*(volatile __near __bitf_T *)0x362)
#define TSTART20       (((volatile __near __bitf_T *)0x362)->no0)
#define TSTART21       (((volatile __near __bitf_T *)0x362)->no2)
#define TRTMD2         (*(volatile __near unsigned char  *)0x363)
#define TRTCMP3        (*(volatile __near unsigned short *)0x368)
#define TRTCMP30       (*(volatile __near unsigned char  *)0x368)
#define TRTCMP31       (*(volatile __near unsigned char  *)0x369)
#define TRTCR3         (*(volatile __near unsigned char  *)0x36A)
#define TRTCR3_bit     (*(volatile __near __bitf_T *)0x36A)
#define TSTART30       (((volatile __near __bitf_T *)0x36A)->no0)
#define TSTART31       (((volatile __near __bitf_T *)0x36A)->no2)
#define TRTMD3         (*(volatile __near unsigned char  *)0x36B)
#define RTCPORSR       (*(volatile __near unsigned char  *)0x380)
#define RTCICNFEN      (*(volatile __near unsigned char  *)0x382)
#define SCMC           (*(volatile __near unsigned char  *)0x384)
#define SCSC           (*(volatile __near unsigned char  *)0x386)
#define SCSC_bit       (*(volatile __near __bitf_T *)0x386)
#define XTSTOP         (((volatile __near __bitf_T *)0x386)->no6)
#define IRCR           (*(volatile __near unsigned char  *)0x3A0)
#define IRCR_bit       (*(volatile __near __bitf_T *)0x3A0)
#define IRRXINV        (((volatile __near __bitf_T *)0x3A0)->no2)
#define IRTXINV        (((volatile __near __bitf_T *)0x3A0)->no3)
#define IRE            (((volatile __near __bitf_T *)0x3A0)->no7)
#define TMPCTL         (*(volatile __near unsigned char  *)0x3B0)
#define TMPCTL_bit     (*(volatile __near __bitf_T *)0x3B0)
#define TMPEN          (((volatile __near __bitf_T *)0x3B0)->no7)
#define SEG0           (*(volatile __near unsigned char  *)0x400)
#define SEG1           (*(volatile __near unsigned char  *)0x401)
#define SEG2           (*(volatile __near unsigned char  *)0x402)
#define SEG3           (*(volatile __near unsigned char  *)0x403)
#define SEG4           (*(volatile __near unsigned char  *)0x404)
#define SEG5           (*(volatile __near unsigned char  *)0x405)
#define SEG6           (*(volatile __near unsigned char  *)0x406)
#define SEG7           (*(volatile __near unsigned char  *)0x407)
#define SEG8           (*(volatile __near unsigned char  *)0x408)
#define SEG9           (*(volatile __near unsigned char  *)0x409)
#define SEG10          (*(volatile __near unsigned char  *)0x40A)
#define SEG11          (*(volatile __near unsigned char  *)0x40B)
#define SEG12          (*(volatile __near unsigned char  *)0x40C)
#define SEG13          (*(volatile __near unsigned char  *)0x40D)
#define SEG14          (*(volatile __near unsigned char  *)0x40E)
#define SEG15          (*(volatile __near unsigned char  *)0x40F)
#define SEG16          (*(volatile __near unsigned char  *)0x410)
#define SEG17          (*(volatile __near unsigned char  *)0x411)
#define SEG18          (*(volatile __near unsigned char  *)0x412)
#define SEG19          (*(volatile __near unsigned char  *)0x413)
#define SEG20          (*(volatile __near unsigned char  *)0x414)
#define SEG21          (*(volatile __near unsigned char  *)0x415)
#define SEG22          (*(volatile __near unsigned char  *)0x416)
#define SEG23          (*(volatile __near unsigned char  *)0x417)
#define SEG24          (*(volatile __near unsigned char  *)0x418)
#define SEG25          (*(volatile __near unsigned char  *)0x419)
#define SEG26          (*(volatile __near unsigned char  *)0x41A)
#define SEG27          (*(volatile __near unsigned char  *)0x41B)
#define SEG28          (*(volatile __near unsigned char  *)0x41C)
#define SEG29          (*(volatile __near unsigned char  *)0x41D)
#define SEG30          (*(volatile __near unsigned char  *)0x41E)
#define SEG31          (*(volatile __near unsigned char  *)0x41F)
#define SEG32          (*(volatile __near unsigned char  *)0x420)
#define SEG33          (*(volatile __near unsigned char  *)0x421)
#define SEG34          (*(volatile __near unsigned char  *)0x422)
#define SEG35          (*(volatile __near unsigned char  *)0x423)
#define SEG36          (*(volatile __near unsigned char  *)0x424)
#define SEG37          (*(volatile __near unsigned char  *)0x425)
