Tejaswini-KR/3-Phase-Smart-Meter/Source/rl78i1c/application/modbus/iodefine.h
#define SEG38          (*(volatile __near unsigned char  *)0x426)
#define SEG39          (*(volatile __near unsigned char  *)0x427)
#define SEG40          (*(volatile __near unsigned char  *)0x428)
#define SEG41          (*(volatile __near unsigned char  *)0x429)
#define TRT0           (*(volatile __near unsigned short *)0x540)
#define TRT00          (*(volatile __near unsigned char  *)0x540)
#define TRT01          (*(volatile __near unsigned char  *)0x541)
#define TRT1           (*(volatile __near unsigned short *)0x548)
#define TRT10          (*(volatile __near unsigned char  *)0x548)
#define TRT11          (*(volatile __near unsigned char  *)0x549)
#define TRT2           (*(volatile __near unsigned short *)0x550)
#define TRT20          (*(volatile __near unsigned char  *)0x550)
#define TRT21          (*(volatile __near unsigned char  *)0x551)
#define TRT3           (*(volatile __near unsigned short *)0x558)
#define TRT30          (*(volatile __near unsigned char  *)0x558)
#define TRT31          (*(volatile __near unsigned char  *)0x559)
#define TRJ0           (*(volatile __near unsigned short *)0x560)
#define TRJ1           (*(volatile __near unsigned short *)0x562)
#define R64CNT         (*(volatile __near unsigned char  *)0x581)
#define BCNT0          (*(volatile __near unsigned char  *)0x583)
#define RSECCNT        (*(volatile __near unsigned char  *)0x583)
#define BCNT1          (*(volatile __near unsigned char  *)0x585)
#define RMINCNT        (*(volatile __near unsigned char  *)0x585)
#define BCNT2          (*(volatile __near unsigned char  *)0x587)
#define RHRCNT         (*(volatile __near unsigned char  *)0x587)
#define BCNT3          (*(volatile __near unsigned char  *)0x589)
#define RWKCNT         (*(volatile __near unsigned char  *)0x589)
#define RDAYCNT        (*(volatile __near unsigned char  *)0x58B)
#define RMONCNT        (*(volatile __near unsigned char  *)0x58D)
#define RYRCNT         (*(volatile __near unsigned short *)0x58E)
#define BCNT0AR0       (*(volatile __near unsigned char  *)0x591)
#define RSECAR0        (*(volatile __near unsigned char  *)0x591)
#define BCNT1AR0       (*(volatile __near unsigned char  *)0x593)
#define RMINAR0        (*(volatile __near unsigned char  *)0x593)
#define BCNT2AR0       (*(volatile __near unsigned char  *)0x595)
#define RHRAR0         (*(volatile __near unsigned char  *)0x595)
#define BCNT3AR0       (*(volatile __near unsigned char  *)0x597)
#define RWKAR0         (*(volatile __near unsigned char  *)0x597)
#define BCNT0AER0      (*(volatile __near unsigned char  *)0x599)
#define RDAYAR0        (*(volatile __near unsigned char  *)0x599)
#define BCNT1AER0      (*(volatile __near unsigned char  *)0x59B)
#define RMONAR0        (*(volatile __near unsigned char  *)0x59B)
#define BCNT2AER0      (*(volatile __near unsigned short *)0x59C)
#define RYRAR0         (*(volatile __near unsigned short *)0x59C)
#define BCNT3AER0      (*(volatile __near unsigned char  *)0x59F)
#define RYRAREN0       (*(volatile __near unsigned char  *)0x59F)
#define RYRAREN0_bit   (*(volatile __near __bitf_T *)0x59F)
#define RSR            (*(volatile __near unsigned char  *)0x5A1)
#define RSR_bit        (*(volatile __near __bitf_T *)0x5A1)
#define RCR1           (*(volatile __near unsigned char  *)0x5A3)
#define RCR2           (*(volatile __near unsigned char  *)0x5A5)
#define RCR3           (*(volatile __near unsigned char  *)0x5A7)
#define RCR4           (*(volatile __near unsigned char  *)0x5A9)
#define RADJ           (*(volatile __near unsigned char  *)0x5AF)
#define BCNT0AR1       (*(volatile __near unsigned char  *)0x5B1)
#define RSECAR1        (*(volatile __near unsigned char  *)0x5B1)
#define BCNT1AR1       (*(volatile __near unsigned char  *)0x5B3)
#define RMINAR1        (*(volatile __near unsigned char  *)0x5B3)
#define BCNT2AR1       (*(volatile __near unsigned char  *)0x5B5)
#define RHRAR1         (*(volatile __near unsigned char  *)0x5B5)
#define BCNT3AR1       (*(volatile __near unsigned char  *)0x5B7)
#define RWKAR1         (*(volatile __near unsigned char  *)0x5B7)
#define BCNT0AER1      (*(volatile __near unsigned char  *)0x5B9)
#define RDAYAR1        (*(volatile __near unsigned char  *)0x5B9)
#define BCNT1AER1      (*(volatile __near unsigned char  *)0x5BB)
#define RMONAR1        (*(volatile __near unsigned char  *)0x5BB)
#define BCNT2AER1      (*(volatile __near unsigned short *)0x5BC)
#define RYRAR1         (*(volatile __near unsigned short *)0x5BC)
#define BCNT3AER1      (*(volatile __near unsigned char  *)0x5BF)
#define RYRAREN1       (*(volatile __near unsigned char  *)0x5BF)
#define RYRAREN1_bit   (*(volatile __near __bitf_T *)0x5BF)
#define RTCCR0         (*(volatile __near unsigned char  *)0x5C1)
#define RTCCR0_bit     (*(volatile __near __bitf_T *)0x5C1)
#define RTCCR1         (*(volatile __near unsigned char  *)0x5C3)
#define RTCCR1_bit     (*(volatile __near __bitf_T *)0x5C3)
#define RTCCR2         (*(volatile __near unsigned char  *)0x5C5)
#define RTCCR2_bit     (*(volatile __near __bitf_T *)0x5C5)
#define BCNT0CP0       (*(volatile __near unsigned char  *)0x5D3)
#define RSECCP0        (*(volatile __near unsigned char  *)0x5D3)
#define BCNT1CP0       (*(volatile __near unsigned char  *)0x5D5)
#define RMINCP0        (*(volatile __near unsigned char  *)0x5D5)
#define BCNT2CP0       (*(volatile __near unsigned char  *)0x5D7)
#define RHRCP0         (*(volatile __near unsigned char  *)0x5D7)
#define BCNT3CP0       (*(volatile __near unsigned char  *)0x5DB)
#define RDAYCP0        (*(volatile __near unsigned char  *)0x5DB)
#define RMONCP0        (*(volatile __near unsigned char  *)0x5DD)
#define BCNT0CP1       (*(volatile __near unsigned char  *)0x5E3)
#define RSECCP1        (*(volatile __near unsigned char  *)0x5E3)
#define BCNT1CP1       (*(volatile __near unsigned char  *)0x5E5)
#define RMINCP1        (*(volatile __near unsigned char  *)0x5E5)
#define BCNT2CP1       (*(volatile __near unsigned char  *)0x5E7)
#define RHRCP1         (*(volatile __near unsigned char  *)0x5E7)
#define BCNT3CP1       (*(volatile __near unsigned char  *)0x5EB)
#define RDAYCP1        (*(volatile __near unsigned char  *)0x5EB)
#define RMONCP1        (*(volatile __near unsigned char  *)0x5ED)
#define BCNT0CP2       (*(volatile __near unsigned char  *)0x5F3)
#define RSECCP2        (*(volatile __near unsigned char  *)0x5F3)
#define BCNT1CP2       (*(volatile __near unsigned char  *)0x5F5)
#define RMINCP2        (*(volatile __near unsigned char  *)0x5F5)
#define BCNT2CP2       (*(volatile __near unsigned char  *)0x5F7)
#define RHRCP2         (*(volatile __near unsigned char  *)0x5F7)
#define BCNT3CP2       (*(volatile __near unsigned char  *)0x5FB)
#define RDAYCP2        (*(volatile __near unsigned char  *)0x5FB)
#define RMONCP2        (*(volatile __near unsigned char  *)0x5FD)
#define ADCSR          (*(volatile __near unsigned short *)0x600)
#define ADANSA0        (*(volatile __near unsigned short *)0x604)
#define ADADS0         (*(volatile __near unsigned short *)0x608)
#define ADADC          (*(volatile __near unsigned char  *)0x60C)
#define ADADC_bit      (*(volatile __near __bitf_T *)0x60C)
#define AVEE           (((volatile __near __bitf_T *)0x60C)->no7)
#define ADCER          (*(volatile __near unsigned short *)0x60E)
#define ADSTRGR        (*(volatile __near unsigned short *)0x610)
#define ADEXICR        (*(volatile __near unsigned short *)0x612)
#define ADTSDR         (*(volatile __near unsigned short *)0x61A)
#define ADOCDR         (*(volatile __near unsigned short *)0x61C)
#define ADRD           (*(volatile __near unsigned short *)0x61E)
#define ADDR0          (*(volatile __near unsigned short *)0x620)
#define ADDR1          (*(volatile __near unsigned short *)0x622)
#define ADDR2          (*(volatile __near unsigned short *)0x624)
#define ADDR3          (*(volatile __near unsigned short *)0x626)
#define ADDR4          (*(volatile __near unsigned short *)0x628)
#define ADDR5          (*(volatile __near unsigned short *)0x62A)
#define ADSHCR         (*(volatile __near unsigned short *)0x666)
#define ADHVREFCNT     (*(volatile __near unsigned char  *)0x68A)
#define ADHVREFCNT_bit (*(volatile __near __bitf_T *)0x68A)
#define ADSLP          (((volatile __near __bitf_T *)0x68A)->no7)
#define ADSSTRT        (*(volatile __near unsigned char  *)0x6DE)
#define ADSSTRO        (*(volatile __near unsigned char  *)0x6DF)
#define ADSSTR0        (*(volatile __near unsigned char  *)0x6E0)
#define ADSSTR1        (*(volatile __near unsigned char  *)0x6E1)
#define ADSSTR2        (*(volatile __near unsigned char  *)0x6E2)
#define ADSSTR3        (*(volatile __near unsigned char  *)0x6E3)
#define ADSSTR4        (*(volatile __near unsigned char  *)0x6E4)
#define ADSSTR5        (*(volatile __near unsigned char  *)0x6E5)
#define DSADMR         (*(volatile __near unsigned short *)0x740)
#define DSADGCR0       (*(volatile __near unsigned char  *)0x742)
#define DSADGCR1       (*(volatile __near unsigned char  *)0x743)
#define DSADHPFCR      (*(volatile __near unsigned char  *)0x745)
#define DSADDECCR      (*(volatile __near unsigned char  *)0x746)
#define DSADDECCR_bit  (*(volatile __near __bitf_T *)0x746)
#define DSADDECSEL     (((volatile __near __bitf_T *)0x746)->no0)
#define DSADDECEN      (((volatile __near __bitf_T *)0x746)->no7)
#define DSADPHCR0      (*(volatile __near unsigned short *)0x750)
#define DSADPHCR1      (*(volatile __near unsigned short *)0x752)
#define DSADPHCR2      (*(volatile __near unsigned short *)0x754)
#define DSADPHCR3      (*(volatile __near unsigned short *)0x756)
#define DSADCR0        (*(volatile __near unsigned short *)0x760)
#define DSADCR0L       (*(volatile __near unsigned char  *)0x760)
#define DSADCR0M       (*(volatile __near unsigned char  *)0x761)
#define DSADCR0H       (*(volatile __near unsigned char  *)0x762)
#define DSADCR1        (*(volatile __near unsigned short *)0x764)
#define DSADCR1L       (*(volatile __near unsigned char  *)0x764)
#define DSADCR1M       (*(volatile __near unsigned char  *)0x765)
#define DSADCR1H       (*(volatile __near unsigned char  *)0x766)
#define DSADCR2        (*(volatile __near unsigned short *)0x768)
#define DSADCR2L       (*(volatile __near unsigned char  *)0x768)
#define DSADCR2M       (*(volatile __near unsigned char  *)0x769)
#define DSADCR2H       (*(volatile __near unsigned char  *)0x76A)
#define DSADCR3        (*(volatile __near unsigned short *)0x76C)
#define DSADCR3L       (*(volatile __near unsigned char  *)0x76C)
#define DSADCR3M       (*(volatile __near unsigned char  *)0x76D)
#define DSADCR3H       (*(volatile __near unsigned char  *)0x76E)
#define DSADCRLPF0     (*(volatile __near unsigned short *)0x770)
#define DSADCRLPF0L    (*(volatile __near unsigned char  *)0x770)
#define DSADCRLPF0M    (*(volatile __near unsigned char  *)0x771)
#define DSADCRLPF0H    (*(volatile __near unsigned char  *)0x772)
#define DSADCRLPF1     (*(volatile __near unsigned short *)0x774)
#define DSADCRLPF1L    (*(volatile __near unsigned char  *)0x774)
#define DSADCRLPF1M    (*(volatile __near unsigned char  *)0x775)
#define DSADCRLPF1H    (*(volatile __near unsigned char  *)0x776)
#define DSADCRLPF2     (*(volatile __near unsigned short *)0x778)
#define DSADCRLPF2L    (*(volatile __near unsigned char  *)0x778)
#define DSADCRLPF2M    (*(volatile __near unsigned char  *)0x779)
#define DSADCRLPF2H    (*(volatile __near unsigned char  *)0x77A)
#define DSADCRLPF3     (*(volatile __near unsigned short *)0x77C)
#define DSADCRLPF3L    (*(volatile __near unsigned char  *)0x77C)
#define DSADCRLPF3M    (*(volatile __near unsigned char  *)0x77D)
#define DSADCRLPF3H    (*(volatile __near unsigned char  *)0x77E)
#define P0             (*(volatile __near unsigned char  *)0xFF00)
#define P0_bit         (*(volatile __near __bitf_T *)0xFF00)
#define P1             (*(volatile __near unsigned char  *)0xFF01)
#define P1_bit         (*(volatile __near __bitf_T *)0xFF01)
#define P2             (*(volatile __near unsigned char  *)0xFF02)
#define P2_bit         (*(volatile __near __bitf_T *)0xFF02)
#define P3             (*(volatile __near unsigned char  *)0xFF03)
#define P3_bit         (*(volatile __near __bitf_T *)0xFF03)
#define P4             (*(volatile __near unsigned char  *)0xFF04)
#define P4_bit         (*(volatile __near __bitf_T *)0xFF04)
#define P5             (*(volatile __near unsigned char  *)0xFF05)
#define P5_bit         (*(volatile __near __bitf_T *)0xFF05)
#define P6             (*(volatile __near unsigned char  *)0xFF06)
#define P6_bit         (*(volatile __near __bitf_T *)0xFF06)
#define P7             (*(volatile __near unsigned char  *)0xFF07)
#define P7_bit         (*(volatile __near __bitf_T *)0xFF07)
#define P8             (*(volatile __near unsigned char  *)0xFF08)
#define P8_bit         (*(volatile __near __bitf_T *)0xFF08)
#define P9             (*(volatile __near unsigned char  *)0xFF09)
#define P9_bit         (*(volatile __near __bitf_T *)0xFF09)
#define P12            (*(volatile __near unsigned char  *)0xFF0C)
#define P12_bit        (*(volatile __near __bitf_T *)0xFF0C)
#define P13            (*(volatile __near unsigned char  *)0xFF0D)
#define P13_bit        (*(volatile __near __bitf_T *)0xFF0D)
#define P15            (*(volatile __near unsigned char  *)0xFF0F)
#define P15_bit        (*(volatile __near __bitf_T *)0xFF0F)
#define SDR00          (*(volatile __near unsigned short *)0xFF10)
#define SIO00          (*(volatile __near unsigned char  *)0xFF10)
#define TXD0           (*(volatile __near unsigned char  *)0xFF10)
#define SDR01          (*(volatile __near unsigned short *)0xFF12)
#define RXD0           (*(volatile __near unsigned char  *)0xFF12)
#define SDR12          (*(volatile __near unsigned short *)0xFF14)
#define SIO30          (*(volatile __near unsigned char  *)0xFF14)
#define TXD3           (*(volatile __near unsigned char  *)0xFF14)
#define SDR13          (*(volatile __near unsigned short *)0xFF16)
#define RXD3           (*(volatile __near unsigned char  *)0xFF16)
#define TDR00          (*(volatile __near unsigned short *)0xFF18)
#define TDR01          (*(volatile __near unsigned short *)0xFF1A)
#define TDR01L         (*(volatile __near unsigned char  *)0xFF1A)
#define TDR01H         (*(volatile __near unsigned char  *)0xFF1B)
#define PM0            (*(volatile __near unsigned char  *)0xFF20)
#define PM0_bit        (*(volatile __near __bitf_T *)0xFF20)
#define PM1            (*(volatile __near unsigned char  *)0xFF21)
#define PM1_bit        (*(volatile __near __bitf_T *)0xFF21)
#define PM2            (*(volatile __near unsigned char  *)0xFF22)
#define PM2_bit        (*(volatile __near __bitf_T *)0xFF22)
#define PM3            (*(volatile __near unsigned char  *)0xFF23)
#define PM3_bit        (*(volatile __near __bitf_T *)0xFF23)
#define PM4            (*(volatile __near unsigned char  *)0xFF24)
#define PM4_bit        (*(volatile __near __bitf_T *)0xFF24)
#define PM5            (*(volatile __near unsigned char  *)0xFF25)
#define PM5_bit        (*(volatile __near __bitf_T *)0xFF25)
#define PM6            (*(volatile __near unsigned char  *)0xFF26)
#define PM6_bit        (*(volatile __near __bitf_T *)0xFF26)
#define PM7            (*(volatile __near unsigned char  *)0xFF27)
#define PM7_bit        (*(volatile __near __bitf_T *)0xFF27)
#define PM8            (*(volatile __near unsigned char  *)0xFF28)
#define PM8_bit        (*(volatile __near __bitf_T *)0xFF28)
#define PM9            (*(volatile __near unsigned char  *)0xFF29)
#define PM9_bit        (*(volatile __near __bitf_T *)0xFF29)
#define PM12           (*(volatile __near unsigned char  *)0xFF2C)
#define PM12_bit       (*(volatile __near __bitf_T *)0xFF2C)
#define PM15           (*(volatile __near unsigned char  *)0xFF2F)
#define PM15_bit       (*(volatile __near __bitf_T *)0xFF2F)
#define KRCTL          (*(volatile __near unsigned char  *)0xFF34)
#define KRCTL_bit      (*(volatile __near __bitf_T *)0xFF34)
#define KREG           (((volatile __near __bitf_T *)0xFF34)->no0)
#define KRMD           (((volatile __near __bitf_T *)0xFF34)->no7)
#define KRF            (*(volatile __near unsigned char  *)0xFF35)
#define KRM0           (*(volatile __near unsigned char  *)0xFF37)
#define KRM0_bit       (*(volatile __near __bitf_T *)0xFF37)
#define EGP0           (*(volatile __near unsigned char  *)0xFF38)
#define EGP0_bit       (*(volatile __near __bitf_T *)0xFF38)
#define EGN0           (*(volatile __near unsigned char  *)0xFF39)
#define EGN0_bit       (*(volatile __near __bitf_T *)0xFF39)
#define EGP1           (*(volatile __near unsigned char  *)0xFF3A)
#define EGP1_bit       (*(volatile __near __bitf_T *)0xFF3A)
#define EGN1           (*(volatile __near unsigned char  *)0xFF3B)
#define EGN1_bit       (*(volatile __near __bitf_T *)0xFF3B)
#define MULBL          (*(volatile __near unsigned short *)0xFF3C)
#define MULBH          (*(volatile __near unsigned short *)0xFF3E)
#define LCDM0          (*(volatile __near unsigned char  *)0xFF40)
#define LCDM1          (*(volatile __near unsigned char  *)0xFF41)
#define LCDM1_bit      (*(volatile __near __bitf_T *)0xFF41)
#define LCDVLM         (((volatile __near __bitf_T *)0xFF41)->no0)
#define LCDSEL         (((volatile __near __bitf_T *)0xFF41)->no3)
#define BLON           (((volatile __near __bitf_T *)0xFF41)->no4)
#define VLCON          (((volatile __near __bitf_T *)0xFF41)->no5)
#define SCOC           (((volatile __near __bitf_T *)0xFF41)->no6)
#define LCDON          (((volatile __near __bitf_T *)0xFF41)->no7)
#define LCDC0          (*(volatile __near unsigned char  *)0xFF42)
#define VLCD           (*(volatile __near unsigned char  *)0xFF43)
#define SDR02          (*(volatile __near unsigned short *)0xFF44)
#define SIO10          (*(volatile __near unsigned char  *)0xFF44)
#define TXD1           (*(volatile __near unsigned char  *)0xFF44)
#define SDR03          (*(volatile __near unsigned short *)0xFF46)
#define RXD1           (*(volatile __near unsigned char  *)0xFF46)
#define SDR10          (*(volatile __near unsigned short *)0xFF48)
#define TXD2           (*(volatile __near unsigned char  *)0xFF48)
#define SDR11          (*(volatile __near unsigned short *)0xFF4A)
#define RXD2           (*(volatile __near unsigned char  *)0xFF4A)
#define IICA0          (*(volatile __near unsigned char  *)0xFF50)
#define IICS0          (*(volatile __near unsigned char  *)0xFF51)
#define IICS0_bit      (*(volatile __near __bitf_T *)0xFF51)
#define SPD0           (((volatile __near __bitf_T *)0xFF51)->no0)
#define STD0           (((volatile __near __bitf_T *)0xFF51)->no1)
#define ACKD0          (((volatile __near __bitf_T *)0xFF51)->no2)
#define TRC0           (((volatile __near __bitf_T *)0xFF51)->no3)
#define COI0           (((volatile __near __bitf_T *)0xFF51)->no4)
#define EXC0           (((volatile __near __bitf_T *)0xFF51)->no5)
#define ALD0           (((volatile __near __bitf_T *)0xFF51)->no6)
#define MSTS0          (((volatile __near __bitf_T *)0xFF51)->no7)
#define IICF0          (*(volatile __near unsigned char  *)0xFF52)
#define IICF0_bit      (*(volatile __near __bitf_T *)0xFF52)
#define IICRSV0        (((volatile __near __bitf_T *)0xFF52)->no0)
#define STCEN0         (((volatile __near __bitf_T *)0xFF52)->no1)
#define IICBSY0        (((volatile __near __bitf_T *)0xFF52)->no6)
#define STCF0          (((volatile __near __bitf_T *)0xFF52)->no7)
#define SDR20          (*(volatile __near unsigned short *)0xFF58)
#define TXD4           (*(volatile __near unsigned char  *)0xFF58)
#define SDR21          (*(volatile __near unsigned short *)0xFF5A)
#define RXD4           (*(volatile __near unsigned char  *)0xFF5A)
#define TDR02          (*(volatile __near unsigned short *)0xFF64)
#define TDR03          (*(volatile __near unsigned short *)0xFF66)
#define TDR03L         (*(volatile __near unsigned char  *)0xFF66)
#define TDR03H         (*(volatile __near unsigned char  *)0xFF67)
#define TDR04          (*(volatile __near unsigned short *)0xFF68)
#define TDR05          (*(volatile __near unsigned short *)0xFF6A)
#define TDR06          (*(volatile __near unsigned short *)0xFF6C)
#define TDR07          (*(volatile __near unsigned short *)0xFF6E)
#define ITMC           (*(volatile __near unsigned short *)0xFF90)
#define CMC            (*(volatile __near unsigned char  *)0xFFA0)
#define CSC            (*(volatile __near unsigned char  *)0xFFA1)
#define CSC_bit        (*(volatile __near __bitf_T *)0xFFA1)
#define HIOSTOP        (((volatile __near __bitf_T *)0xFFA1)->no0)
#define MIOEN          (((volatile __near __bitf_T *)0xFFA1)->no1)
#define XT1SELDIS      (((volatile __near __bitf_T *)0xFFA1)->no6)
#define MSTOP          (((volatile __near __bitf_T *)0xFFA1)->no7)
#define OSTC           (*(volatile __near unsigned char  *)0xFFA2)
#define OSTC_bit       (*(volatile __near __bitf_T *)0xFFA2)
#define OSTS           (*(volatile __near unsigned char  *)0xFFA3)
#define CKC            (*(volatile __near unsigned char  *)0xFFA4)
#define CKC_bit        (*(volatile __near __bitf_T *)0xFFA4)
#define MCM1           (((volatile __near __bitf_T *)0xFFA4)->no0)
#define MCS1           (((volatile __near __bitf_T *)0xFFA4)->no1)
#define MCM0           (((volatile __near __bitf_T *)0xFFA4)->no4)
#define MCS            (((volatile __near __bitf_T *)0xFFA4)->no5)
#define CSS            (((volatile __near __bitf_T *)0xFFA4)->no6)
#define CLS            (((volatile __near __bitf_T *)0xFFA4)->no7)
#define CKS0           (*(volatile __near unsigned char  *)0xFFA5)
#define CKS0_bit       (*(volatile __near __bitf_T *)0xFFA5)
#define PCLOE0         (((volatile __near __bitf_T *)0xFFA5)->no7)
#define CKS1           (*(volatile __near unsigned char  *)0xFFA6)
#define CKS1_bit       (*(volatile __near __bitf_T *)0xFFA6)
#define PCLOE1         (((volatile __near __bitf_T *)0xFFA6)->no7)
#define CKSEL          (*(volatile __near unsigned char  *)0xFFA7)
#define CKSEL_bit      (*(volatile __near __bitf_T *)0xFFA7)
#define SELLOSC        (((volatile __near __bitf_T *)0xFFA7)->no0)
#define RESF           (*(volatile __near unsigned char  *)0xFFA8)
#define LVIM           (*(volatile __near unsigned char  *)0xFFA9)
#define LVIM_bit       (*(volatile __near __bitf_T *)0xFFA9)
#define LVIF           (((volatile __near __bitf_T *)0xFFA9)->no0)
#define LVIOMSK        (((volatile __near __bitf_T *)0xFFA9)->no1)
#define LVISEN         (((volatile __near __bitf_T *)0xFFA9)->no7)
#define LVIS           (*(volatile __near unsigned char  *)0xFFAA)
#define LVIS_bit       (*(volatile __near __bitf_T *)0xFFAA)
#define LVILV          (((volatile __near __bitf_T *)0xFFAA)->no0)
#define LVIMD          (((volatile __near __bitf_T *)0xFFAA)->no7)
#define WDTE           (*(volatile __near unsigned char  *)0xFFAB)
#define CRCIN          (*(volatile __near unsigned char  *)0xFFAC)
#define IF2            (*(volatile __near unsigned short *)0xFFD0)
#define IF2L           (*(volatile __near unsigned char  *)0xFFD0)
#define IF2L_bit       (*(volatile __near __bitf_T *)0xFFD0)
#define IF2H           (*(volatile __near unsigned char  *)0xFFD1)
#define IF2H_bit       (*(volatile __near __bitf_T *)0xFFD1)
#define DSAIF          (((volatile __near __bitf_T *)0xFFD0)->no0)
#define SMPIF05        (((volatile __near __bitf_T *)0xFFD0)->no0)
#define SMPIF15        (((volatile __near __bitf_T *)0xFFD0)->no0)
#define TMIF04         (((volatile __near __bitf_T *)0xFFD0)->no1)
#define SMOTAIF0       (((volatile __near __bitf_T *)0xFFD0)->no2)
#define TMIF05         (((volatile __near __bitf_T *)0xFFD0)->no2)
#define PIF6           (((volatile __near __bitf_T *)0xFFD0)->no3)
#define PIF7           (((volatile __near __bitf_T *)0xFFD0)->no4)
#define PIF12          (((volatile __near __bitf_T *)0xFFD0)->no5)
#define RTCIIF2        (((volatile __near __bitf_T *)0xFFD0)->no5)
#define PIF13          (((volatile __near __bitf_T *)0xFFD0)->no6)
#define RTCIIF1        (((volatile __near __bitf_T *)0xFFD0)->no6)
