Tejaswini-KR/3-Phase-Smart-Meter/Source/rl78i1c/application/modbus/iodefine.h
#define RTCIIF0        (((volatile __near __bitf_T *)0xFFD0)->no7)
#define PIF14          (((volatile __near __bitf_T *)0xFFD0)->no7)
#define SMOTBIF0       (((volatile __near __bitf_T *)0xFFD1)->no0)
#define TMIF06         (((volatile __near __bitf_T *)0xFFD1)->no0)
#define SMOTAIF1       (((volatile __near __bitf_T *)0xFFD1)->no1)
#define TMIF07         (((volatile __near __bitf_T *)0xFFD1)->no1)
#define ITIF00         (((volatile __near __bitf_T *)0xFFD1)->no2)
#define ITIF01         (((volatile __near __bitf_T *)0xFFD1)->no3)
#define SREIF3         (((volatile __near __bitf_T *)0xFFD1)->no4)
#define MACIF          (((volatile __near __bitf_T *)0xFFD1)->no5)
#define SMOTBIF1       (((volatile __near __bitf_T *)0xFFD1)->no5)
#define OSDIF          (((volatile __near __bitf_T *)0xFFD1)->no6)
#define FLIF           (((volatile __near __bitf_T *)0xFFD1)->no7)
#define IF3            (*(volatile __near unsigned short *)0xFFD2)
#define IF3L           (*(volatile __near unsigned char  *)0xFFD2)
#define IF3L_bit       (*(volatile __near __bitf_T *)0xFFD2)
#define IF3H           (*(volatile __near unsigned char  *)0xFFD3)
#define IF3H_bit       (*(volatile __near __bitf_T *)0xFFD3)
#define PIF8           (((volatile __near __bitf_T *)0xFFD2)->no0)
#define PIF9           (((volatile __near __bitf_T *)0xFFD2)->no1)
#define ITIF10         (((volatile __near __bitf_T *)0xFFD2)->no2)
#define ITIF11         (((volatile __near __bitf_T *)0xFFD2)->no3)
#define ITIF20         (((volatile __near __bitf_T *)0xFFD2)->no4)
#define LVDVDIF        (((volatile __near __bitf_T *)0xFFD2)->no4)
#define ITIF21         (((volatile __near __bitf_T *)0xFFD2)->no5)
#define LVDVBIF        (((volatile __near __bitf_T *)0xFFD2)->no5)
#define ITIF30         (((volatile __near __bitf_T *)0xFFD2)->no6)
#define LVDVRIF        (((volatile __near __bitf_T *)0xFFD2)->no6)
#define ITIF31         (((volatile __near __bitf_T *)0xFFD2)->no7)
#define LVDEXIF        (((volatile __near __bitf_T *)0xFFD2)->no7)
#define STIF4          (((volatile __near __bitf_T *)0xFFD3)->no0)
#define STMGIF1        (((volatile __near __bitf_T *)0xFFD3)->no0)
#define SRIF4          (((volatile __near __bitf_T *)0xFFD3)->no1)
#define SRMGIF1        (((volatile __near __bitf_T *)0xFFD3)->no1)
#define SREIF4         (((volatile __near __bitf_T *)0xFFD3)->no2)
#define SREMGIF1       (((volatile __near __bitf_T *)0xFFD3)->no2)
#define DSADECIF       (((volatile __near __bitf_T *)0xFFD3)->no3)
#define TRJIF0         (((volatile __near __bitf_T *)0xFFD3)->no3)
#define TRJIF1         (((volatile __near __bitf_T *)0xFFD3)->no4)
#define MK2            (*(volatile __near unsigned short *)0xFFD4)
#define MK2L           (*(volatile __near unsigned char  *)0xFFD4)
#define MK2L_bit       (*(volatile __near __bitf_T *)0xFFD4)
#define MK2H           (*(volatile __near unsigned char  *)0xFFD5)
#define MK2H_bit       (*(volatile __near __bitf_T *)0xFFD5)
#define DSAMK          (((volatile __near __bitf_T *)0xFFD4)->no0)
#define SMPMK05        (((volatile __near __bitf_T *)0xFFD4)->no0)
#define SMPMK15        (((volatile __near __bitf_T *)0xFFD4)->no0)
#define TMMK04         (((volatile __near __bitf_T *)0xFFD4)->no1)
#define SMOTAMK0       (((volatile __near __bitf_T *)0xFFD4)->no2)
#define TMMK05         (((volatile __near __bitf_T *)0xFFD4)->no2)
#define PMK6           (((volatile __near __bitf_T *)0xFFD4)->no3)
#define PMK7           (((volatile __near __bitf_T *)0xFFD4)->no4)
#define PMK12          (((volatile __near __bitf_T *)0xFFD4)->no5)
#define RTCIMK2        (((volatile __near __bitf_T *)0xFFD4)->no5)
#define PMK13          (((volatile __near __bitf_T *)0xFFD4)->no6)
#define RTCIMK1        (((volatile __near __bitf_T *)0xFFD4)->no6)
#define RTCIMK0        (((volatile __near __bitf_T *)0xFFD4)->no7)
#define PMK14          (((volatile __near __bitf_T *)0xFFD4)->no7)
#define SMOTBMK0       (((volatile __near __bitf_T *)0xFFD5)->no0)
#define TMMK06         (((volatile __near __bitf_T *)0xFFD5)->no0)
#define SMOTAMK1       (((volatile __near __bitf_T *)0xFFD5)->no1)
#define TMMK07         (((volatile __near __bitf_T *)0xFFD5)->no1)
#define ITMK00         (((volatile __near __bitf_T *)0xFFD5)->no2)
#define ITMK01         (((volatile __near __bitf_T *)0xFFD5)->no3)
#define SREMK3         (((volatile __near __bitf_T *)0xFFD5)->no4)
#define MACMK          (((volatile __near __bitf_T *)0xFFD5)->no5)
#define SMOTBMK1       (((volatile __near __bitf_T *)0xFFD5)->no5)
#define OSDMK          (((volatile __near __bitf_T *)0xFFD5)->no6)
#define FLMK           (((volatile __near __bitf_T *)0xFFD5)->no7)
#define MK3            (*(volatile __near unsigned short *)0xFFD6)
#define MK3L           (*(volatile __near unsigned char  *)0xFFD6)
#define MK3L_bit       (*(volatile __near __bitf_T *)0xFFD6)
#define MK3H           (*(volatile __near unsigned char  *)0xFFD7)
#define MK3H_bit       (*(volatile __near __bitf_T *)0xFFD7)
#define PMK8           (((volatile __near __bitf_T *)0xFFD6)->no0)
#define PMK9           (((volatile __near __bitf_T *)0xFFD6)->no1)
#define ITMK10         (((volatile __near __bitf_T *)0xFFD6)->no2)
#define ITMK11         (((volatile __near __bitf_T *)0xFFD6)->no3)
#define ITMK20         (((volatile __near __bitf_T *)0xFFD6)->no4)
#define LVDVDMK        (((volatile __near __bitf_T *)0xFFD6)->no4)
#define ITMK21         (((volatile __near __bitf_T *)0xFFD6)->no5)
#define LVDVBMK        (((volatile __near __bitf_T *)0xFFD6)->no5)
#define ITMK30         (((volatile __near __bitf_T *)0xFFD6)->no6)
#define LVDVRMK        (((volatile __near __bitf_T *)0xFFD6)->no6)
#define ITMK31         (((volatile __near __bitf_T *)0xFFD6)->no7)
#define LVDEXMK        (((volatile __near __bitf_T *)0xFFD6)->no7)
#define STMGMK1        (((volatile __near __bitf_T *)0xFFD7)->no0)
#define STMK4          (((volatile __near __bitf_T *)0xFFD7)->no0)
#define SRMGMK1        (((volatile __near __bitf_T *)0xFFD7)->no1)
#define SRMK4          (((volatile __near __bitf_T *)0xFFD7)->no1)
#define SREMGMK1       (((volatile __near __bitf_T *)0xFFD7)->no2)
#define SREMK4         (((volatile __near __bitf_T *)0xFFD7)->no2)
#define DSADECMK       (((volatile __near __bitf_T *)0xFFD7)->no3)
#define TRJMK0         (((volatile __near __bitf_T *)0xFFD7)->no3)
#define TRJMK1         (((volatile __near __bitf_T *)0xFFD7)->no4)
#define PR02           (*(volatile __near unsigned short *)0xFFD8)
#define PR02L          (*(volatile __near unsigned char  *)0xFFD8)
#define PR02L_bit      (*(volatile __near __bitf_T *)0xFFD8)
#define PR02H          (*(volatile __near unsigned char  *)0xFFD9)
#define PR02H_bit      (*(volatile __near __bitf_T *)0xFFD9)
#define DSAPR0         (((volatile __near __bitf_T *)0xFFD8)->no0)
#define SMPPR005       (((volatile __near __bitf_T *)0xFFD8)->no0)
#define SMPPR015       (((volatile __near __bitf_T *)0xFFD8)->no0)
#define TMPR004        (((volatile __near __bitf_T *)0xFFD8)->no1)
#define SMOTAPR00      (((volatile __near __bitf_T *)0xFFD8)->no2)
#define TMPR005        (((volatile __near __bitf_T *)0xFFD8)->no2)
#define PPR06          (((volatile __near __bitf_T *)0xFFD8)->no3)
#define PPR07          (((volatile __near __bitf_T *)0xFFD8)->no4)
#define PPR012         (((volatile __near __bitf_T *)0xFFD8)->no5)
#define RTCIPR02       (((volatile __near __bitf_T *)0xFFD8)->no5)
#define PPR013         (((volatile __near __bitf_T *)0xFFD8)->no6)
#define RTCIPR01       (((volatile __near __bitf_T *)0xFFD8)->no6)
#define RTCIPR00       (((volatile __near __bitf_T *)0xFFD8)->no7)
#define PPR014         (((volatile __near __bitf_T *)0xFFD8)->no7)
#define SMOTBPR00      (((volatile __near __bitf_T *)0xFFD9)->no0)
#define TMPR006        (((volatile __near __bitf_T *)0xFFD9)->no0)
#define SMOTAPR01      (((volatile __near __bitf_T *)0xFFD9)->no1)
#define TMPR007        (((volatile __near __bitf_T *)0xFFD9)->no1)
#define ITPR000        (((volatile __near __bitf_T *)0xFFD9)->no2)
#define ITPR001        (((volatile __near __bitf_T *)0xFFD9)->no3)
#define SREPR03        (((volatile __near __bitf_T *)0xFFD9)->no4)
#define MACPR0         (((volatile __near __bitf_T *)0xFFD9)->no5)
#define SMOTBPR01      (((volatile __near __bitf_T *)0xFFD9)->no5)
#define OSDPR0         (((volatile __near __bitf_T *)0xFFD9)->no6)
#define FLPR0          (((volatile __near __bitf_T *)0xFFD9)->no7)
#define PR03           (*(volatile __near unsigned short *)0xFFDA)
#define PR03L          (*(volatile __near unsigned char  *)0xFFDA)
#define PR03L_bit      (*(volatile __near __bitf_T *)0xFFDA)
#define PR03H          (*(volatile __near unsigned char  *)0xFFDB)
#define PR03H_bit      (*(volatile __near __bitf_T *)0xFFDB)
#define PPR08          (((volatile __near __bitf_T *)0xFFDA)->no0)
#define PPR09          (((volatile __near __bitf_T *)0xFFDA)->no1)
#define ITPR010        (((volatile __near __bitf_T *)0xFFDA)->no2)
#define ITPR011        (((volatile __near __bitf_T *)0xFFDA)->no3)
#define ITPR020        (((volatile __near __bitf_T *)0xFFDA)->no4)
#define LVDVDPR0       (((volatile __near __bitf_T *)0xFFDA)->no4)
#define ITPR021        (((volatile __near __bitf_T *)0xFFDA)->no5)
#define LVDVBPR0       (((volatile __near __bitf_T *)0xFFDA)->no5)
#define ITPR030        (((volatile __near __bitf_T *)0xFFDA)->no6)
#define LVDVRPR0       (((volatile __near __bitf_T *)0xFFDA)->no6)
#define ITPR031        (((volatile __near __bitf_T *)0xFFDA)->no7)
#define LVDEXPR0       (((volatile __near __bitf_T *)0xFFDA)->no7)
#define STMGPR01       (((volatile __near __bitf_T *)0xFFDB)->no0)
#define STPR04         (((volatile __near __bitf_T *)0xFFDB)->no0)
#define SRMGPR01       (((volatile __near __bitf_T *)0xFFDB)->no1)
#define SRPR04         (((volatile __near __bitf_T *)0xFFDB)->no1)
#define SREMGPR01      (((volatile __near __bitf_T *)0xFFDB)->no2)
#define SREPR04        (((volatile __near __bitf_T *)0xFFDB)->no2)
#define DSADECPR0      (((volatile __near __bitf_T *)0xFFDB)->no3)
#define TRJPR00        (((volatile __near __bitf_T *)0xFFDB)->no3)
#define TRJPR01        (((volatile __near __bitf_T *)0xFFDB)->no4)
#define PR12           (*(volatile __near unsigned short *)0xFFDC)
#define PR12L          (*(volatile __near unsigned char  *)0xFFDC)
#define PR12L_bit      (*(volatile __near __bitf_T *)0xFFDC)
#define PR12H          (*(volatile __near unsigned char  *)0xFFDD)
#define PR12H_bit      (*(volatile __near __bitf_T *)0xFFDD)
#define DSAPR1         (((volatile __near __bitf_T *)0xFFDC)->no0)
#define SMPPR105       (((volatile __near __bitf_T *)0xFFDC)->no0)
#define SMPPR115       (((volatile __near __bitf_T *)0xFFDC)->no0)
#define TMPR104        (((volatile __near __bitf_T *)0xFFDC)->no1)
#define SMOTAPR10      (((volatile __near __bitf_T *)0xFFDC)->no2)
#define TMPR105        (((volatile __near __bitf_T *)0xFFDC)->no2)
#define PPR16          (((volatile __near __bitf_T *)0xFFDC)->no3)
#define PPR17          (((volatile __near __bitf_T *)0xFFDC)->no4)
#define PPR112         (((volatile __near __bitf_T *)0xFFDC)->no5)
#define RTCIPR12       (((volatile __near __bitf_T *)0xFFDC)->no5)
#define PPR113         (((volatile __near __bitf_T *)0xFFDC)->no6)
#define RTCIPR11       (((volatile __near __bitf_T *)0xFFDC)->no6)
#define RTCIPR10       (((volatile __near __bitf_T *)0xFFDC)->no7)
#define PPR114         (((volatile __near __bitf_T *)0xFFDC)->no7)
#define SMOTBPR10      (((volatile __near __bitf_T *)0xFFDD)->no0)
#define TMPR106        (((volatile __near __bitf_T *)0xFFDD)->no0)
#define SMOTAPR11      (((volatile __near __bitf_T *)0xFFDD)->no1)
#define TMPR107        (((volatile __near __bitf_T *)0xFFDD)->no1)
#define ITPR100        (((volatile __near __bitf_T *)0xFFDD)->no2)
#define ITPR101        (((volatile __near __bitf_T *)0xFFDD)->no3)
#define SREPR13        (((volatile __near __bitf_T *)0xFFDD)->no4)
#define MACPR1         (((volatile __near __bitf_T *)0xFFDD)->no5)
#define SMOTBPR11      (((volatile __near __bitf_T *)0xFFDD)->no5)
#define OSDPR1         (((volatile __near __bitf_T *)0xFFDD)->no6)
#define FLPR1          (((volatile __near __bitf_T *)0xFFDD)->no7)
#define PR13           (*(volatile __near unsigned short *)0xFFDE)
#define PR13L          (*(volatile __near unsigned char  *)0xFFDE)
#define PR13L_bit      (*(volatile __near __bitf_T *)0xFFDE)
#define PR13H          (*(volatile __near unsigned char  *)0xFFDF)
#define PR13H_bit      (*(volatile __near __bitf_T *)0xFFDF)
#define PPR18          (((volatile __near __bitf_T *)0xFFDE)->no0)
#define PPR19          (((volatile __near __bitf_T *)0xFFDE)->no1)
#define ITPR110        (((volatile __near __bitf_T *)0xFFDE)->no2)
#define ITPR111        (((volatile __near __bitf_T *)0xFFDE)->no3)
#define ITPR120        (((volatile __near __bitf_T *)0xFFDE)->no4)
#define LVDVDPR1       (((volatile __near __bitf_T *)0xFFDE)->no4)
#define ITPR121        (((volatile __near __bitf_T *)0xFFDE)->no5)
#define LVDVBPR1       (((volatile __near __bitf_T *)0xFFDE)->no5)
#define ITPR130        (((volatile __near __bitf_T *)0xFFDE)->no6)
#define LVDVRPR1       (((volatile __near __bitf_T *)0xFFDE)->no6)
#define ITPR131        (((volatile __near __bitf_T *)0xFFDE)->no7)
#define LVDEXPR1       (((volatile __near __bitf_T *)0xFFDE)->no7)
#define STMGPR11       (((volatile __near __bitf_T *)0xFFDF)->no0)
#define STPR14         (((volatile __near __bitf_T *)0xFFDF)->no0)
#define SRMGPR11       (((volatile __near __bitf_T *)0xFFDF)->no1)
#define SRPR14         (((volatile __near __bitf_T *)0xFFDF)->no1)
#define SREMGPR11      (((volatile __near __bitf_T *)0xFFDF)->no2)
#define SREPR14        (((volatile __near __bitf_T *)0xFFDF)->no2)
#define DSADECPR1      (((volatile __near __bitf_T *)0xFFDF)->no3)
#define TRJPR10        (((volatile __near __bitf_T *)0xFFDF)->no3)
#define TRJPR11        (((volatile __near __bitf_T *)0xFFDF)->no4)
#define IF0            (*(volatile __near unsigned short *)0xFFE0)
#define IF0L           (*(volatile __near unsigned char  *)0xFFE0)
#define IF0L_bit       (*(volatile __near __bitf_T *)0xFFE0)
#define IF0H           (*(volatile __near unsigned char  *)0xFFE1)
#define IF0H_bit       (*(volatile __near __bitf_T *)0xFFE1)
#define WDTIIF         (((volatile __near __bitf_T *)0xFFE0)->no0)
#define LVIIF          (((volatile __near __bitf_T *)0xFFE0)->no1)
#define PIF0           (((volatile __near __bitf_T *)0xFFE0)->no2)
#define PIF1           (((volatile __near __bitf_T *)0xFFE0)->no3)
#define PIF2           (((volatile __near __bitf_T *)0xFFE0)->no4)
#define PIF3           (((volatile __near __bitf_T *)0xFFE0)->no5)
#define PIF4           (((volatile __near __bitf_T *)0xFFE0)->no6)
#define PIF5           (((volatile __near __bitf_T *)0xFFE0)->no7)
#define STIF2          (((volatile __near __bitf_T *)0xFFE1)->no0)
#define STMGIF0        (((volatile __near __bitf_T *)0xFFE1)->no0)
#define SRIF2          (((volatile __near __bitf_T *)0xFFE1)->no1)
#define SRMGIF0        (((volatile __near __bitf_T *)0xFFE1)->no1)
#define SREIF2         (((volatile __near __bitf_T *)0xFFE1)->no2)
#define SREMGIF0       (((volatile __near __bitf_T *)0xFFE1)->no2)
#define CRIF           (((volatile __near __bitf_T *)0xFFE1)->no3)
#define SMPIF00        (((volatile __near __bitf_T *)0xFFE1)->no3)
#define SMPIF10        (((volatile __near __bitf_T *)0xFFE1)->no3)
#define CSIIF00        (((volatile __near __bitf_T *)0xFFE1)->no5)
#define IICIF00        (((volatile __near __bitf_T *)0xFFE1)->no5)
#define STIF0          (((volatile __near __bitf_T *)0xFFE1)->no5)
#define IICAIF0        (((volatile __near __bitf_T *)0xFFE1)->no6)
#define SRIF0          (((volatile __near __bitf_T *)0xFFE1)->no7)
#define IF1            (*(volatile __near unsigned short *)0xFFE2)
#define IF1L           (*(volatile __near unsigned char  *)0xFFE2)
#define IF1L_bit       (*(volatile __near __bitf_T *)0xFFE2)
#define IF1H           (*(volatile __near unsigned char  *)0xFFE3)
#define IF1H_bit       (*(volatile __near __bitf_T *)0xFFE3)
#define SREIF0         (((volatile __near __bitf_T *)0xFFE2)->no0)
#define TMIF01H        (((volatile __near __bitf_T *)0xFFE2)->no0)
#define CSIIF10        (((volatile __near __bitf_T *)0xFFE2)->no1)
#define IICIF10        (((volatile __near __bitf_T *)0xFFE2)->no1)
#define STIF1          (((volatile __near __bitf_T *)0xFFE2)->no1)
#define SRIF1          (((volatile __near __bitf_T *)0xFFE2)->no2)
#define SREIF1         (((volatile __near __bitf_T *)0xFFE2)->no3)
#define TMIF03H        (((volatile __near __bitf_T *)0xFFE2)->no3)
#define TMIF00         (((volatile __near __bitf_T *)0xFFE2)->no4)
#define RTCAIF0        (((volatile __near __bitf_T *)0xFFE2)->no5)
#define SMPIF01        (((volatile __near __bitf_T *)0xFFE2)->no5)
#define SMPIF11        (((volatile __near __bitf_T *)0xFFE2)->no5)
#define FMIF           (((volatile __near __bitf_T *)0xFFE2)->no6)
#define SMPIF02        (((volatile __near __bitf_T *)0xFFE2)->no6)
#define SMPIF12        (((volatile __near __bitf_T *)0xFFE2)->no6)
#define TMIF01         (((volatile __near __bitf_T *)0xFFE2)->no7)
#define TMIF02         (((volatile __near __bitf_T *)0xFFE3)->no0)
#define TMIF03         (((volatile __near __bitf_T *)0xFFE3)->no1)
#define ADIF           (((volatile __near __bitf_T *)0xFFE3)->no2)
#define RTCRIF         (((volatile __near __bitf_T *)0xFFE3)->no3)
#define SMPIF03        (((volatile __near __bitf_T *)0xFFE3)->no3)
#define SMPIF13        (((volatile __near __bitf_T *)0xFFE3)->no3)
#define TMKAIF         (((volatile __near __bitf_T *)0xFFE3)->no4)
#define KRIF           (((volatile __near __bitf_T *)0xFFE3)->no5)
#define RTCAIF1        (((volatile __near __bitf_T *)0xFFE3)->no5)
#define SMPIF04        (((volatile __near __bitf_T *)0xFFE3)->no5)
#define SMPIF14        (((volatile __near __bitf_T *)0xFFE3)->no5)
#define CSIIF30        (((volatile __near __bitf_T *)0xFFE3)->no6)
#define IICIF30        (((volatile __near __bitf_T *)0xFFE3)->no6)
#define STIF3          (((volatile __near __bitf_T *)0xFFE3)->no6)
#define SRIF3          (((volatile __near __bitf_T *)0xFFE3)->no7)
#define MK0            (*(volatile __near unsigned short *)0xFFE4)
#define MK0L           (*(volatile __near unsigned char  *)0xFFE4)
#define MK0L_bit       (*(volatile __near __bitf_T *)0xFFE4)
#define MK0H           (*(volatile __near unsigned char  *)0xFFE5)
#define MK0H_bit       (*(volatile __near __bitf_T *)0xFFE5)
#define WDTIMK         (((volatile __near __bitf_T *)0xFFE4)->no0)
#define LVIMK          (((volatile __near __bitf_T *)0xFFE4)->no1)
#define PMK0           (((volatile __near __bitf_T *)0xFFE4)->no2)
#define PMK1           (((volatile __near __bitf_T *)0xFFE4)->no3)
#define PMK2           (((volatile __near __bitf_T *)0xFFE4)->no4)
#define PMK3           (((volatile __near __bitf_T *)0xFFE4)->no5)
#define PMK4           (((volatile __near __bitf_T *)0xFFE4)->no6)
#define PMK5           (((volatile __near __bitf_T *)0xFFE4)->no7)
#define STMGMK0        (((volatile __near __bitf_T *)0xFFE5)->no0)
#define STMK2          (((volatile __near __bitf_T *)0xFFE5)->no0)
#define SRMGMK0        (((volatile __near __bitf_T *)0xFFE5)->no1)
#define SRMK2          (((volatile __near __bitf_T *)0xFFE5)->no1)
#define SREMGMK0       (((volatile __near __bitf_T *)0xFFE5)->no2)
#define SREMK2         (((volatile __near __bitf_T *)0xFFE5)->no2)
#define CRMK           (((volatile __near __bitf_T *)0xFFE5)->no3)
#define SMPMK00        (((volatile __near __bitf_T *)0xFFE5)->no3)
#define SMPMK10        (((volatile __near __bitf_T *)0xFFE5)->no3)
#define CSIMK00        (((volatile __near __bitf_T *)0xFFE5)->no5)
#define IICMK00        (((volatile __near __bitf_T *)0xFFE5)->no5)
#define STMK0          (((volatile __near __bitf_T *)0xFFE5)->no5)
#define IICAMK0        (((volatile __near __bitf_T *)0xFFE5)->no6)
#define SRMK0          (((volatile __near __bitf_T *)0xFFE5)->no7)
#define MK1            (*(volatile __near unsigned short *)0xFFE6)
#define MK1L           (*(volatile __near unsigned char  *)0xFFE6)
#define MK1L_bit       (*(volatile __near __bitf_T *)0xFFE6)
#define MK1H           (*(volatile __near unsigned char  *)0xFFE7)
#define MK1H_bit       (*(volatile __near __bitf_T *)0xFFE7)
#define SREMK0         (((volatile __near __bitf_T *)0xFFE6)->no0)
#define TMMK01H        (((volatile __near __bitf_T *)0xFFE6)->no0)
#define CSIMK10        (((volatile __near __bitf_T *)0xFFE6)->no1)
#define IICMK10        (((volatile __near __bitf_T *)0xFFE6)->no1)
#define STMK1          (((volatile __near __bitf_T *)0xFFE6)->no1)
#define SRMK1          (((volatile __near __bitf_T *)0xFFE6)->no2)
#define SREMK1         (((volatile __near __bitf_T *)0xFFE6)->no3)
#define TMMK03H        (((volatile __near __bitf_T *)0xFFE6)->no3)
#define TMMK00         (((volatile __near __bitf_T *)0xFFE6)->no4)
#define RTCAMK0        (((volatile __near __bitf_T *)0xFFE6)->no5)
#define SMPMK01        (((volatile __near __bitf_T *)0xFFE6)->no5)
#define SMPMK11        (((volatile __near __bitf_T *)0xFFE6)->no5)
#define FMMK           (((volatile __near __bitf_T *)0xFFE6)->no6)
#define SMPMK02        (((volatile __near __bitf_T *)0xFFE6)->no6)
#define SMPMK12        (((volatile __near __bitf_T *)0xFFE6)->no6)
#define TMMK01         (((volatile __near __bitf_T *)0xFFE6)->no7)
#define TMMK02         (((volatile __near __bitf_T *)0xFFE7)->no0)
#define TMMK03         (((volatile __near __bitf_T *)0xFFE7)->no1)
#define ADMK           (((volatile __near __bitf_T *)0xFFE7)->no2)
#define RTCRMK         (((volatile __near __bitf_T *)0xFFE7)->no3)
#define SMPMK03        (((volatile __near __bitf_T *)0xFFE7)->no3)
#define SMPMK13        (((volatile __near __bitf_T *)0xFFE7)->no3)
#define TMKAMK         (((volatile __near __bitf_T *)0xFFE7)->no4)
#define KRMK           (((volatile __near __bitf_T *)0xFFE7)->no5)
#define RTCAMK1        (((volatile __near __bitf_T *)0xFFE7)->no5)
#define SMPMK04        (((volatile __near __bitf_T *)0xFFE7)->no5)
#define SMPMK14        (((volatile __near __bitf_T *)0xFFE7)->no5)
#define CSIMK30        (((volatile __near __bitf_T *)0xFFE7)->no6)
#define IICMK30        (((volatile __near __bitf_T *)0xFFE7)->no6)
#define STMK3          (((volatile __near __bitf_T *)0xFFE7)->no6)
#define SRMK3          (((volatile __near __bitf_T *)0xFFE7)->no7)
#define PR00           (*(volatile __near unsigned short *)0xFFE8)
#define PR00L          (*(volatile __near unsigned char  *)0xFFE8)
#define PR00L_bit      (*(volatile __near __bitf_T *)0xFFE8)
#define PR00H          (*(volatile __near unsigned char  *)0xFFE9)
#define PR00H_bit      (*(volatile __near __bitf_T *)0xFFE9)
#define WDTIPR0        (((volatile __near __bitf_T *)0xFFE8)->no0)
#define LVIPR0         (((volatile __near __bitf_T *)0xFFE8)->no1)
#define PPR00          (((volatile __near __bitf_T *)0xFFE8)->no2)
#define PPR01          (((volatile __near __bitf_T *)0xFFE8)->no3)
#define PPR02          (((volatile __near __bitf_T *)0xFFE8)->no4)
#define PPR03          (((volatile __near __bitf_T *)0xFFE8)->no5)
#define PPR04          (((volatile __near __bitf_T *)0xFFE8)->no6)
#define PPR05          (((volatile __near __bitf_T *)0xFFE8)->no7)
#define STMGPR00       (((volatile __near __bitf_T *)0xFFE9)->no0)
#define STPR02         (((volatile __near __bitf_T *)0xFFE9)->no0)
#define SRMGPR00       (((volatile __near __bitf_T *)0xFFE9)->no1)
#define SRPR02         (((volatile __near __bitf_T *)0xFFE9)->no1)
#define SREMGPR00      (((volatile __near __bitf_T *)0xFFE9)->no2)
#define SREPR02        (((volatile __near __bitf_T *)0xFFE9)->no2)
#define CRPR0          (((volatile __near __bitf_T *)0xFFE9)->no3)
#define SMPPR000       (((volatile __near __bitf_T *)0xFFE9)->no3)
#define SMPPR010       (((volatile __near __bitf_T *)0xFFE9)->no3)
#define CSIPR000       (((volatile __near __bitf_T *)0xFFE9)->no5)
#define IICPR000       (((volatile __near __bitf_T *)0xFFE9)->no5)
#define STPR00         (((volatile __near __bitf_T *)0xFFE9)->no5)
#define IICAPR00       (((volatile __near __bitf_T *)0xFFE9)->no6)
#define SRPR00         (((volatile __near __bitf_T *)0xFFE9)->no7)
