Tejaswini-KR/3-Phase-Smart-Meter/Source/rl78i1c/application/modbus/iodefine.h
#define PR01           (*(volatile __near unsigned short *)0xFFEA)
#define PR01L          (*(volatile __near unsigned char  *)0xFFEA)
#define PR01L_bit      (*(volatile __near __bitf_T *)0xFFEA)
#define PR01H          (*(volatile __near unsigned char  *)0xFFEB)
#define PR01H_bit      (*(volatile __near __bitf_T *)0xFFEB)
#define SREPR00        (((volatile __near __bitf_T *)0xFFEA)->no0)
#define TMPR001H       (((volatile __near __bitf_T *)0xFFEA)->no0)
#define CSIPR010       (((volatile __near __bitf_T *)0xFFEA)->no1)
#define IICPR010       (((volatile __near __bitf_T *)0xFFEA)->no1)
#define STPR01         (((volatile __near __bitf_T *)0xFFEA)->no1)
#define SRPR01         (((volatile __near __bitf_T *)0xFFEA)->no2)
#define SREPR01        (((volatile __near __bitf_T *)0xFFEA)->no3)
#define TMPR003H       (((volatile __near __bitf_T *)0xFFEA)->no3)
#define TMPR000        (((volatile __near __bitf_T *)0xFFEA)->no4)
#define RTCAPR00       (((volatile __near __bitf_T *)0xFFEA)->no5)
#define SMPPR001       (((volatile __near __bitf_T *)0xFFEA)->no5)
#define SMPPR011       (((volatile __near __bitf_T *)0xFFEA)->no5)
#define FMPR0          (((volatile __near __bitf_T *)0xFFEA)->no6)
#define SMPPR002       (((volatile __near __bitf_T *)0xFFEA)->no6)
#define SMPPR012       (((volatile __near __bitf_T *)0xFFEA)->no6)
#define TMPR001        (((volatile __near __bitf_T *)0xFFEA)->no7)
#define TMPR002        (((volatile __near __bitf_T *)0xFFEB)->no0)
#define TMPR003        (((volatile __near __bitf_T *)0xFFEB)->no1)
#define ADPR0          (((volatile __near __bitf_T *)0xFFEB)->no2)
#define RTCRPR0        (((volatile __near __bitf_T *)0xFFEB)->no3)
#define SMPPR003       (((volatile __near __bitf_T *)0xFFEB)->no3)
#define SMPPR013       (((volatile __near __bitf_T *)0xFFEB)->no3)
#define TMKAPR0        (((volatile __near __bitf_T *)0xFFEB)->no4)
#define KRPR0          (((volatile __near __bitf_T *)0xFFEB)->no5)
#define RTCAPR01       (((volatile __near __bitf_T *)0xFFEB)->no5)
#define SMPPR004       (((volatile __near __bitf_T *)0xFFEB)->no5)
#define SMPPR014       (((volatile __near __bitf_T *)0xFFEB)->no5)
#define CSIPR030       (((volatile __near __bitf_T *)0xFFEB)->no6)
#define IICPR030       (((volatile __near __bitf_T *)0xFFEB)->no6)
#define STPR03         (((volatile __near __bitf_T *)0xFFEB)->no6)
#define SRPR03         (((volatile __near __bitf_T *)0xFFEB)->no7)
#define PR10           (*(volatile __near unsigned short *)0xFFEC)
#define PR10L          (*(volatile __near unsigned char  *)0xFFEC)
#define PR10L_bit      (*(volatile __near __bitf_T *)0xFFEC)
#define PR10H          (*(volatile __near unsigned char  *)0xFFED)
#define PR10H_bit      (*(volatile __near __bitf_T *)0xFFED)
#define WDTIPR1        (((volatile __near __bitf_T *)0xFFEC)->no0)
#define LVIPR1         (((volatile __near __bitf_T *)0xFFEC)->no1)
#define PPR10          (((volatile __near __bitf_T *)0xFFEC)->no2)
#define PPR11          (((volatile __near __bitf_T *)0xFFEC)->no3)
#define PPR12          (((volatile __near __bitf_T *)0xFFEC)->no4)
#define PPR13          (((volatile __near __bitf_T *)0xFFEC)->no5)
#define PPR14          (((volatile __near __bitf_T *)0xFFEC)->no6)
#define PPR15          (((volatile __near __bitf_T *)0xFFEC)->no7)
#define STMGPR10       (((volatile __near __bitf_T *)0xFFED)->no0)
#define STPR12         (((volatile __near __bitf_T *)0xFFED)->no0)
#define SRMGPR10       (((volatile __near __bitf_T *)0xFFED)->no1)
#define SRPR12         (((volatile __near __bitf_T *)0xFFED)->no1)
#define SREMGPR10      (((volatile __near __bitf_T *)0xFFED)->no2)
#define SREPR12        (((volatile __near __bitf_T *)0xFFED)->no2)
#define CRPR1          (((volatile __near __bitf_T *)0xFFED)->no3)
#define SMPPR100       (((volatile __near __bitf_T *)0xFFED)->no3)
#define SMPPR110       (((volatile __near __bitf_T *)0xFFED)->no3)
#define CSIPR100       (((volatile __near __bitf_T *)0xFFED)->no5)
#define IICPR100       (((volatile __near __bitf_T *)0xFFED)->no5)
#define STPR10         (((volatile __near __bitf_T *)0xFFED)->no5)
#define IICAPR10       (((volatile __near __bitf_T *)0xFFED)->no6)
#define SRPR10         (((volatile __near __bitf_T *)0xFFED)->no7)
#define PR11           (*(volatile __near unsigned short *)0xFFEE)
#define PR11L          (*(volatile __near unsigned char  *)0xFFEE)
#define PR11L_bit      (*(volatile __near __bitf_T *)0xFFEE)
#define PR11H          (*(volatile __near unsigned char  *)0xFFEF)
#define PR11H_bit      (*(volatile __near __bitf_T *)0xFFEF)
#define SREPR10        (((volatile __near __bitf_T *)0xFFEE)->no0)
#define TMPR101H       (((volatile __near __bitf_T *)0xFFEE)->no0)
#define CSIPR110       (((volatile __near __bitf_T *)0xFFEE)->no1)
#define IICPR110       (((volatile __near __bitf_T *)0xFFEE)->no1)
#define STPR11         (((volatile __near __bitf_T *)0xFFEE)->no1)
#define SRPR11         (((volatile __near __bitf_T *)0xFFEE)->no2)
#define SREPR11        (((volatile __near __bitf_T *)0xFFEE)->no3)
#define TMPR103H       (((volatile __near __bitf_T *)0xFFEE)->no3)
#define TMPR100        (((volatile __near __bitf_T *)0xFFEE)->no4)
#define RTCAPR10       (((volatile __near __bitf_T *)0xFFEE)->no5)
#define SMPPR101       (((volatile __near __bitf_T *)0xFFEE)->no5)
#define SMPPR111       (((volatile __near __bitf_T *)0xFFEE)->no5)
#define FMPR1          (((volatile __near __bitf_T *)0xFFEE)->no6)
#define SMPPR102       (((volatile __near __bitf_T *)0xFFEE)->no6)
#define SMPPR112       (((volatile __near __bitf_T *)0xFFEE)->no6)
#define TMPR101        (((volatile __near __bitf_T *)0xFFEE)->no7)
#define TMPR102        (((volatile __near __bitf_T *)0xFFEF)->no0)
#define TMPR103        (((volatile __near __bitf_T *)0xFFEF)->no1)
#define ADPR1          (((volatile __near __bitf_T *)0xFFEF)->no2)
#define RTCRPR1        (((volatile __near __bitf_T *)0xFFEF)->no3)
#define SMPPR103       (((volatile __near __bitf_T *)0xFFEF)->no3)
#define SMPPR113       (((volatile __near __bitf_T *)0xFFEF)->no3)
#define TMKAPR1        (((volatile __near __bitf_T *)0xFFEF)->no4)
#define KRPR1          (((volatile __near __bitf_T *)0xFFEF)->no5)
#define RTCAPR11       (((volatile __near __bitf_T *)0xFFEF)->no5)
#define SMPPR104       (((volatile __near __bitf_T *)0xFFEF)->no5)
#define SMPPR114       (((volatile __near __bitf_T *)0xFFEF)->no5)
#define CSIPR130       (((volatile __near __bitf_T *)0xFFEF)->no6)
#define IICPR130       (((volatile __near __bitf_T *)0xFFEF)->no6)
#define STPR13         (((volatile __near __bitf_T *)0xFFEF)->no6)
#define SRPR13         (((volatile __near __bitf_T *)0xFFEF)->no7)
#define MACRL          (*(volatile __near unsigned short *)0xFFF0)
#define MACRH          (*(volatile __near unsigned short *)0xFFF2)
#define PMC            (*(volatile __near unsigned char  *)0xFFFE)
#define PMC_bit        (*(volatile __near __bitf_T *)0xFFFE)
#define MAA            (((volatile __near __bitf_T *)0xFFFE)->no0)


#define INTWDTI                         0x0004
#define INTLVI                          0x0006
#define INTP0                           0x0008
#define INTP1                           0x000A
#define INTP2                           0x000C
#define INTP3                           0x000E
#define INTP4                           0x0010
#define INTP5                           0x0012
#define INTST2                          0x0014
#define INTSTMG0                        0x0014
#define INTSR2                          0x0016
#define INTSRMG0                        0x0016
#define INTSRE2                         0x0018
#define INTSREMG0                       0x0018
#define INTCR                           0x001A
#define INTSMP00                        0x001A
#define INTSMP10                        0x001A
#define INTCSI00                        0x001E
#define INTIIC00                        0x001E
#define INTST0                          0x001E
#define INTIICA0                        0x0020
#define INTSR0                          0x0022
#define INTSRE0                         0x0024
#define INTTM01H                        0x0024
#define INTCSI10                        0x0026
#define INTIIC10                        0x0026
#define INTST1                          0x0026
#define INTSR1                          0x0028
#define INTSRE1                         0x002A
#define INTTM03H                        0x002A
#define INTTM00                         0x002C
#define INTRTCALM0                      0x002E
#define INTSMP01                        0x002E
#define INTSMP11                        0x002E
#define INTFM                           0x0030
#define INTSMP02                        0x0030
#define INTSMP12                        0x0030
#define INTTM01                         0x0032
#define INTTM02                         0x0034
#define INTTM03                         0x0036
#define INTAD                           0x0038
#define INTRTCPRD                       0x003A
#define INTSMP03                        0x003A
#define INTSMP13                        0x003A
#define INTIT                           0x003C
#define INTKR                           0x003E
#define INTRTCALM1                      0x003E
#define INTSMP04                        0x003E
#define INTSMP14                        0x003E
#define INTCSI30                        0x0040
#define INTIIC30                        0x0040
#define INTST3                          0x0040
#define INTSR3                          0x0042
#define INTDSAD                         0x0044
#define INTSMP05                        0x0044
#define INTSMP15                        0x0044
#define INTTM04                         0x0046
#define INTSMOTA0                       0x0048
#define INTTM05                         0x0048
#define INTP6                           0x004A
#define INTP7                           0x004C
#define INTP12                          0x004E
#define INTRTCIC2                       0x004E
#define INTP13                          0x0050
#define INTRTCIC1                       0x0050
#define INTP14                          0x0052
#define INTRTCIC0                       0x0052
#define INTSMOTB0                       0x0054
#define INTTM06                         0x0054
#define INTSMOTA1                       0x0056
#define INTTM07                         0x0056
#define INTIT00                         0x0058
#define INTIT01                         0x005A
#define INTSRE3                         0x005C
#define INTMACLOF                       0x005E
#define INTSMOTB1                       0x005E
#define INTOSDC                         0x0060
#define INTFL                           0x0062
#define INTP8                           0x0064
#define INTP9                           0x0066
#define INTIT10                         0x0068
#define INTIT11                         0x006A
#define INTIT20                         0x006C
#define INTLVDVDD                       0x006C
#define INTIT21                         0x006E
#define INTLVDVBAT                      0x006E
#define INTIT30                         0x0070
#define INTLVDVRTC                      0x0070
#define INTIT31                         0x0072
#define INTLVDEXLVD                     0x0072
#define INTST4                          0x0074
#define INTSTMG1                        0x0074
#define INTSR4                          0x0076
#define INTSRMG1                        0x0076
#define INTSRE4                         0x0078
#define INTSREMG1                       0x0078
#define INTDSADDEC                      0x007A
#define INTTRJ0                         0x007A
#define INTTRJ1                         0x007C

#endif
